{
    "d2mq9by": [
        {
            "utt_idx": 0,
            "utt_id": "d2mq9by",
            "speaker": "studdbeefpile",
            "text": "&gt; Specifically, I am afraid that he will impose theocracy\n\nYou mean [exactly](http://www.motherjones.com/politics/2005/12/great-debate-our-season-0) the [same](http://www.motherjones.com/politics/2008/11/howard-phillips-world)\n thing all republicans are accused of regardless of what they do?\n\n&gt;He strikes me so much as a real, heartless liar\n\nwhat has he lied about?\n\n&gt;Has no plans to give health care to any American, \n\nExcept [this one](http://thehill.com/policy/healthcare/234499-cruz-unveils-obamacare-alternative), you mean?\n\n&gt; that he will break international law when he has the blood of innocent civilians after carpet bombing on his hands\n\nYou mean like obama did in libya?\n\nIn sum, the only thing you seem to know about Ted Cruz that is true is that he is a republican.  You don't like republicans, and so you don't like Ted Cruz.  But that says much more about you than him.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "d2n3jqf",
            "speaker": "Arkiasis",
            "text": "&gt; Except this one, you mean?\n\n\"It would also repeal Title I of ObamaCare, which would undo much of the law... and subsidies to help people afford coverage\"\n\nYeah, their plan is \"if you can't afford insurance, tough shit for you.\" A war on the poor.",
            "awry_utt": true
        }
    ],
    "d3gyml3": [
        {
            "utt_idx": 0,
            "utt_id": "d3gyml3",
            "speaker": "MakeMexicoPay",
            "text": "Here's the thing.  Trump promotes patriotism over everything else.  He's the \"America first\" candidate.\n\nThe Mainstream Media has twisted everything hes said from turning \"many illegal immigrants are rapists and criminals\" into \"all Mexican immigrants are rapists and criminals\" to turning \"we have to put a pause on Muslim immigration until we figure out how to weed out the troublemakers\" into \"Trump wants to deport all Muslims.\"\n\nIt's not legal immigrants we dislike- we know who they are.  They have had the background checks and have proven they love our country enough to learn about it and know our country better than most natives know it.\n\nIt's the difference between your wife's friend Steve crashing on your couch because he had a fight with his wife and waking up to just \"some guy\" on your couch.\n\nIt's not Muslims we're afraid of, its Islamists.  They're the ones using violence and terrorism to push shiara law.  They're the ones who treat women like domesticated animals.  Do you know the point of a burqa?  It's literally so that men won't get aroused by the woman [and rape her].  Dave Chapelle is a Muslim.  Nobody hates him for it.  Mike Tyson is a Muslim.  Nobody hates him for it.\n\nWhen you really unpack the \"fear\" it's very specifically \"I don't like those Muslims over there that come from x, y, and z countries\" and when you grew up in a place where you stone a woman to death for being raped... how the fuck are you supposed to deprogram that?!",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "d3hbmpu",
            "speaker": "forestfly1234",
            "text": "It isn't Muslims hat we're afraid of, but lets ban all Muslims?\n\nAre you really saying that. That doesn't make any sense. \n\nMuslims that pass citizenship tests probably do know more about America than native citizens. Particularly the part about the first Amendment which Trump doesn't seem to be a fan off. \n\nAnd saying that Trump promotes patriotism over everything else doesn't let him off the hook. Some of the worst leaders in history have promoted patriotism over anything else. \n\n",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "d3hbu80",
            "speaker": "MakeMexicoPay",
            "text": "Most sex offenders would never ever harm a child.  Most understand that molesting a kid would fuck them up for life.  Hell, about a quarter of registered sex offenders who *did* have sex with a minor were underage themselves.\n\nSo why  don't you want a registered sex offender running a daycare?\n\nShit, you wouldn't even let one alone with your child for an hour.  Bigot.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "d3hbwzg",
            "speaker": "forestfly1234",
            "text": "You just made zero sense there. \n\nAre you just going to ignore what I said and talk about something totally different. \n\nYou can't say that a person doesn't have a thing against Muslims when they want to ban all Muslims. \n\nYou aren't making any sense. ",
            "awry_utt": true
        }
    ],
    "d50dc16": [
        {
            "utt_idx": 0,
            "utt_id": "d50dc16",
            "speaker": "rtechie1",
            "text": "Two points:\n\n1) /r/SRS is fundamentally based on hypocrisy. They support a far-left political agenda and are happy to support jokes and satire that follow that agenda, but when they think something is \"racist\" or \"sexist\" they attack the poster and refuse to regard it as satire. You say yourself that they're massive trolls and liars.\n\n2) /r/SRS strongly encourages death threats and doxxing. I don't care if they claim otherwise, that's a fact. If you want to defend /r/SRS, defend their threats and doxxing. \n\n ",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "d50dw5j",
            "speaker": "2k16throwaway",
            "text": "&gt; /r/SRS is fundamentally based on hypocrisy. They support a far-left political agenda and are happy to support jokes and satire that follow that agenda, but when they think something is \"racist\" or \"sexist\" they attack the poster and refuse to regard it as satire. You say yourself that they're massive trolls and liars.\n\nDid you look at the posts from last nights frontpage? Some of them are blatant racism, like calling a group of people inhuman.\n\nSRS isn't \"far left\", most of them are just your everyday liberals. They pretend to be crazy.\n\nMaybe it's because your politics are different and thus that is why you see them as hypocrites. Can't say anything against that, I'm not CMVing about politics. But what I do believe is that reddit's contempt for SRS is unwarranted and grossly exaggerated.\n\n&gt; /r/SRS strongly encourages death threats and doxxing. I don't care if they claim otherwise, that's a fact. If you want to defend /r/SRS, defend their threats and doxxing.\n\nThey don't. You're talking about events that happened years ago including the suicide of black_visions. That was a complete hoax.\n",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "d50ex74",
            "speaker": "rtechie1",
            "text": "&gt; Some of them are blatant racism,\n\nYes, it's mostly fake trolling like most of /r/SRS. \n\n&gt; SRS isn't \"far left\", most of them are just your everyday liberals. They pretend to be crazy.\n\nThere are people on /r/SRS who sincerely believe stuff like \"Racism against white people is impossible\" and \"All men are misogynists\" and \"Gender is a social construct\". They're not all pretending. \n\n&gt; Maybe it's because your politics are different and thus that is why you see them as hypocrites.\n\nThey're hypocrites because they complain about far-right trolls when they are far-left trolls. \n\n&gt; They don't. You're talking about events that happened years ago including the suicide of black_visions. That was a complete hoax.\n\nI've been on reddit for years and I've never received death threats until one of my posts was \"featured\" on /r/SRS. Tons of death threats in my inbox.\n\nThe mods can't use the lame excuse 'We say don't doxx!\" What /r/SRS does as a \"call out\" sub is paint a target on someone and say **Hate this mutherfucker! This person is evil and hate them!** and you want to seriously argue that isn't encouraging death threats? \n",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "d50iofc",
            "speaker": "PM_ME_A_FACT",
            "text": "&gt; I've been on reddit for years and I've never received death threats until one of my posts was \"featured\" on /r/SRS. Tons of death threats in my inbox.\n\nProof?\n\nBecause there is actual proof of people impersonating SRS members to push a fake agenda ",
            "awry_utt": true
        },
        {
            "utt_idx": 4,
            "utt_id": "d50ja09",
            "speaker": "rtechie1",
            "text": "There is no way to prove who sent anonymous death threats, so there is no \"actual proof\" of people impersonating SRS members. \n",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "d50l030",
            "speaker": "PM_ME_A_FACT",
            "text": "Screenshots that you even got a death threat? \n\nIt just seems like such a copout to say you got \"so many death threats\" without actually defending it ",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "d50m0tv",
            "speaker": "rtechie1",
            "text": "Screenshots that I could fake incredibly easily? That's not evidence of anything. Treat my anecdote for what it is. ",
            "awry_utt": false
        },
        {
            "utt_idx": 7,
            "utt_id": "d50mecu",
            "speaker": "PM_ME_A_FACT",
            "text": "Ok so nothing more \"proving\" than a fairy tale ",
            "awry_utt": false
        },
        {
            "utt_idx": 8,
            "utt_id": "d51magm",
            "speaker": "rtechie1",
            "text": "If that's how you want to take my testimony, fine. You can assume I'm lying and I'm not butthurt about it. \n\nKeep trying to pretend the SJW crowd doesn't use threats and harassment. You're on video at DePaul and many other places. \n",
            "awry_utt": false
        }
    ],
    "dagdpgw": [
        {
            "utt_idx": 0,
            "utt_id": "dagdpgw",
            "speaker": "duckandcover",
            "text": "Are you kidding?  What values do we share (or if we share them, what does it say about us?).  Let's be clear.  Putin runs Russia like a Mafia boss.  It is a kleptocracy and he has complete control.  Journalists, political opponents, and others that don't agree with him wind up in jail or dead. He seems to be bent on restoring the \"glory\" of the USSR which seems to include the annexation of Russia's neighbors by military force and other means.  He has just masterminded a wildly successful fake news and propaganda effort affecting the US Pres election.  He seems hell bent on backing up every horrifying dictator. \n\nJust rename Putin Boris Badinoff and stick a fork in it.\n\nin a nutshell, Russia is the USSR Redux but with much better weapons and cyber warfare capability.  Wakeup.\n\n",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "dagjy40",
            "speaker": "1nf3ct3d",
            "text": "Lmao  values. \n\nThat's why the US is supporting Saudi Arabia right ",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "dagvbot",
            "speaker": "duckandcover",
            "text": "I'm not thrilled with them either...so you're idea is \"what the hell, let's support every asshole\"  Anyway, I'm not aware of Saudi Arabia Annexing other countries or threatening our allies (europe).",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "dagvhzg",
            "speaker": "1nf3ct3d",
            "text": "i wouldnt call it annexing but thats debatable.\n\nwell i'd rather have some threathen than actually going to war as is happening in yemen\n\nsaudis bombing the shit out of yemen just everday\n\nand who exactly is russia threatening? ",
            "awry_utt": false
        }
    ],
    "dc5rpz7": [
        {
            "utt_idx": 0,
            "utt_id": "dc5rpz7",
            "speaker": "Holophonist",
            "text": "&gt;Most rural people are gullible and in denial about the future of their counties.\n\nCan you explain what you mean?\n\n&gt;Virtually all rank and file republicans have an erroneous, simplistic, myopic view of the world. They like their simple, comfortable world with bad guys and good guys. Many democrats have a myopic and simplistic view of the world too, but it is less erroneous (anti-GMO/vaccine/nuclear zealots notwithstanding).\n\nAfter spending years arguing with leftists on reddit, I can tell you that the vast majority of them have a view of the world that is almost entirely based on emotional pleas, baseless assertions and sometimes prejudice against white people, old people, rich people, or republicans.\n\n&gt;A depressing amount of republicans hate liberals and educated people such as university professors. They refuse to believe that higher learning truly is valuable and do not accept that the \"liberal elites\" are more qualified to make policies than they are.\n\nWhat republicans hate is elitism. They hate a few people confidently imposing rules from the top down on millions of people. Universities have become a pretty strong figurehead for that, and for liberal elitism in general, with professors being wildly leftwing. If you don't believe that liberal policies work, why would you believe liberal elites are more qualified to make policies? Isn't that the issue? That they don't agree with them?\n\n&gt;Not only that, but they resent and despise those more literate and informed than they are and care more about settling imaginary scores with their caricatural views of them than anything else.\n\nRepublicans are probably not interested enough in intellectualism, and liberals are far far far too obsessed with the appearance of it. What matters is if the ideas are better, and so far none of what you're saying is about ideas. You're just attacking people with vague insults.\n\n&gt;A substantial amount of republicans AND, to a lesser degree, democrats cannot distinguish between baseless smears/fake news and facts.\n\nBecause they've been basically locked out by a media and academia that are left leaning beyond normalcy given the general population and beyond what is reasonable to conclude about the issues. Where do you want them to go when the \"credible\" and \"official\" channels are either lying to them, or giving them propaganda, or at best giving them a liberal-biased version of whatever it is they're telling them?\n\n&gt;Republican politicians are in the pockets of the wealthy and truly do not care if the poor die in the street or if the middle class is destroyed. Their behavior is evil by their own moral standards. Only the rich and their immediate family and friends truly matter to them.\n\nI mean come on. Are you even being serious here? You're assigning motive to people you know nothing about. I'm waiting for where in your post you actually make *arguments* instead of slinging hyperbolic insults with nothing to back it up.\n\n&gt;Over 33% of the population are willing to tolerate racism as long as it's not aimed at them. This number percentage is significantly higher amongst white people.\n\nCan you provide a source for this? I'm having trouble understanding what point you're trying to make. It seems very contrived and not really relevant. It wouldn't surprise me if white people care less about racism in general than minority groups.\n\n&gt;the election of Donald Trump.\n\nwhich is a result of posts like this.\n\n&gt;the inexorable economic decline of industrial rural america.\n\nWhich is due to technology and automation, none of the insults you just made about republicans.\n\n&gt;the countless comments and insults I've seen hurled at liberals (liberals don't have equivalents to libtard or cuck or behavior such as \"rolling coal\").\n\nYou just wrote a huge post dedicated to calling republicans racists and stupid. And if you think leftwing phrases like that don't exist, go visit /r/politics\n\n&gt;Vote tallies for Donald Trump, who has made countless racist, sexist and bigoted comments, exhibited racism in a documented fashion (housing discrimination).\n\nAnother example of republicans being less likely to care about the appearance of these things. Donald trump was an extremely unliked candidate, even when he was elected. This says that republicans voted for him pragmatically, despite those things. Maybe you think saying stupid shit should automatically disqualify you no matter what, but obviously people disagree with you. That doesn't make them racist, sexist or bigoted.\n\n&gt;People who vote republican despite the fact it is factually against their own interest (repealing obamacare, tax cuts for the rich are harmful according to the CBO).\n\nDo you not get the irony? You are the *perfect* example of what they hate. You just said that repealing obamacare is factually against their interest. How in the fucking **world** do you call that a fact? How in the fucking **world** are you going to claim it's a fact that cutting taxes (for basically everybody) is going to be against their own interest. You realize the CBO is only looking at the *budget*, right? That it's not looking at all possible direct and indirect effects of having a low tax, low regulation environment? This is a great example of what's wrong with the left's obsession with the appearance of facts and intellectualism. The CBO has numbers, and numbers are good! Therefore if the CBO says something bad about something, it's a FACT that it's bad. No, in reality, you don't really understand the issue well enough and you're blindly following some group that you put trust in.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "dc5sqzs",
            "speaker": "cyclopsrex",
            "text": "1) Posts on Reddit caused Trump to be elected. You can't be serious.\n\n2) Tax reductions haven't caused growth in the past, why would they now?",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "dc5t47g",
            "speaker": "Holophonist",
            "text": "&gt;1) Posts on Reddit caused Trump to be elected. You can't be serious.\n\nI'm talking about the smug attitude.\n\n&gt;2) Tax reductions haven't caused growth in the past, why would they now?\n\nThat's not such a simple claim, and I'm curious why you think this is the case. There are specific examples of taxes being cut, and GDP rising subsequently. But more than that, the idea is to have an environment of low taxes and low regulations that is conducive to innovation and productivity. That won't be a simple thing to test empirically. For instance, how do you *know* if the booming 90s was just random, or a result of reagan's supply side policies?",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "dc5tba8",
            "speaker": "cyclopsrex",
            "text": "1) Of course people are smug when one side elects a racist reality stat president. \n\n2) If there is no empirical benefit (spoiler: there isn't) then why would you cut taxes. This is the party that doesn't believe in evolution or climate change. Critical thinking isn't in their wheelhouse.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "dc5tg2b",
            "speaker": "Holophonist",
            "text": "&gt;1) Of course people are smug when one side elects a racist reality stat president.\n\nThey've been smug for years, long before Trump was elected, long before he was a serious candidate, long before he was a candidate at all.\n\n&gt;2) If there is no empirical benefit (spoiler: there isn't) then why would you cut taxes. This is the party that doesn't believe in evolution or climate change. Critical thinking isn't in their wheelhouse.\n\nRead what I wrote again. I didn't say there is no empirical benefit, I said it's not simple to TEST EMPIRICALLY. You should probably learn these terms before talking about how ignorant republicans are.",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "dc5thk2",
            "speaker": "cyclopsrex",
            "text": "Do you deny the ignorance on supply side economics, climate change and evolution? Those have been proved. ",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "dc5uren",
            "speaker": "Holophonist",
            "text": "You said tax cuts in the past haven't lead to growth. Prove it ",
            "awry_utt": false
        },
        {
            "utt_idx": 7,
            "utt_id": "dc5uy3q",
            "speaker": "cyclopsrex",
            "text": "It is well documented. You want me to prove evolution too? Educating Republicans just doesn't work. They think a cold day disproves climate change.",
            "awry_utt": false
        },
        {
            "utt_idx": 8,
            "utt_id": "dc5xx15",
            "speaker": "QuantumDischarge",
            "text": "Saying something is well documented is great. Now document it",
            "awry_utt": false
        }
    ],
    "df7wg0w": [
        {
            "utt_idx": 0,
            "utt_id": "df7wg0w",
            "speaker": "MrF33",
            "text": "If men don't want to be killed they should wear armor at all times.\n\nIt's preposterous to think that the onus is on people to not be *victims* of crimes instead of thinking that people should simply not commit them.\n\n&gt;In countries like saudi arabia, there are no rapes, which proves this point.\n\nThis is [**PATENTLY FALSE**](https://en.wikipedia.org/wiki/Rape_in_Saudi_Arabia)\n\nYour position is incorrect, based on gross misinformation, you need to do further research before returning to such a position.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "df7wmo2",
            "speaker": "myshieldsforargus",
            "text": "&gt; If men don't want to be killed they should wear armor at all times.\n\nSome people do wear armor at all time, or carry pistols.\n\nso your point is invalid",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "df7wzen",
            "speaker": "MrF33",
            "text": "But you don't *expect* them to do so.\n\nThe vast majority of people *don't* carry weapons or armor, and you do not blame victims of crime for not carrying weapons.\n\nEspecially in regions which a person has no reasonable expectation of being victim of a crime.\n\nIn the West women have no reasonable expectation of being the victim of rape in the vast majority of public situations.\n\nJust like you would not expect to need to carry a gun when you go to your gym to repel an assault, a woman should not be expected to be raped out of the blue while at the gym either.\n\n",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "df7xfjy",
            "speaker": "myshieldsforargus",
            "text": "&gt; and you do not blame victims of crime for not carrying weapons.\n\nthis was never suggested\n\n",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "df7y12r",
            "speaker": "visvya",
            "text": "&gt; If they don't want to be raped they should just wear a burqa, it is a simple solution that is proven to work 100%\n\nYou are blaming women for not wearing a burqa. The analogy is that if you blame women for that, you should also blame a man for not wearing armor if he is murdered. It's his fault because he refused to wear armor.",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "df7ymtq",
            "speaker": "myshieldsforargus",
            "text": "&gt; You are blaming women for not wearing a burqa. \n\na logical statement is blaming how? please stop trying to pretend everything is an insult to your pet-cause\n\nnobody has said anything about 'somebody's fault' or do you deny the logical progression that wearing a burqa would make it less likely to be raped?",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "df7yu2i",
            "speaker": "chronos280",
            "text": "your argument was \"CMV: If women do not want to be raped, they should put on a burqa\" not \"CMV: Women are more likely to be raped if they don't wear a burqa\". There is an implication in your title (\"they should put on\") that they are at fault for not conforming. I think given the increasingly stretched technicalities you are using to deflect that your view is either changed or never existed in the first place.",
            "awry_utt": false
        }
    ],
    "dflzx0y": [
        {
            "utt_idx": 0,
            "utt_id": "dflzx0y",
            "speaker": "modshavepenisevy",
            "text": "We elected Trump because he represented a chance to curb the cronyism and corruption that has been rife in our Government since WWII. If you wanna circle-jerk that we're all a bunch of bible-thumping idiots, and refresh WaPo, CNN, NYT, and r/Politics every day, go right ahead. But it won't change my resolve and hopefully it won't change his.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "dfm82wc",
            "speaker": "Mike-Hawks",
            "text": "So you don't like cronyism but nepotism is okay?\n\nFuck my brain hurts...",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "dfm9hko",
            "speaker": "modshavepenisevy",
            "text": "What do you think? Systemic cronyism in our government for 50 years or Ivanka Trump trying to promote women's rights and environmentalism while her Dad is president? Does your brain work? What a ridiculous, and I mean ridiculous, counter argument.",
            "awry_utt": true
        }
    ],
    "dkr22wh": [
        {
            "utt_idx": 0,
            "utt_id": "dkr22wh",
            "speaker": "Chel_of_the_sea",
            "text": "&gt; Gay people are objectively attracted to the same gender. This is easy to prove.\n\nEr...it is? Aside from, say, looking at how they respond to things - which would apply just as well to trans people, and [has in fact been done](http://onlinelibrary.wiley.com/doi/10.1111/jsm.12155/abstract) on them.\n\n&gt; Trans problem however don't actually have the brain of the opposite gender.\n\nNot in every respect, no, but a [few](http://www.journalofpsychiatricresearch.com/article/S0022-3956%2810%2900158-5/abstract) studies [show](http://www.ncbi.nlm.nih.gov/pubmed/21195418) patterns [typical](http://www.ncbi.nlm.nih.gov/pubmed/7477289) of their identified gender rather than of their birth sex. You've also got stuff like twin studies, which suggest a moderate genetic component to being trans.\n\n&gt; It's retarded to think they can\n\nWell, hard to argue with such a well-cited source.\n\n&gt; as their sex organs function perfectly which they wouldn't if they were mentally the wrong gender\n\n...what? I'm pretty sure the sex organs function in people who are literally in a vegetative state. They certainly function fine in people with major developmental disabilities - it's a regular problem in the care of such individuals because they lack the mental capacity to understand the consequences of sex.\n\n&gt; Male and female brains differ hugely\n\nIn some respects.\n\n&gt; but trans people always have the brain of their natural gender.\n\nNo, they don't. See above.\n\n&gt; Lumping these \"people\" in with gays does a lot of damage to the gay rights movement.\n\nThe reason we're \"lumped in\" is that we have been a part of the gay rights movement from minute one. The much-publicized Stonewall Inn, for example, was a haven for what we would now consider trans women as well as gay men (at the time, there wasn't nearly as strong a distinction drawn between the two). Almost all of us either are, or appeared at one time to be, LGB: a trans man who is attracted to men is gay; a trans man who is attracted to women 'looks' gay before he  transitions.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "dkr2ems",
            "speaker": "penismuncha",
            "text": "You could use small un-peer reviewed studies with tiny sample sizes to prove anything, the fact is none of them found a tangible link between brain structure and gender dysphoria. If one did we'd all hear about it.\n&gt;...what? I'm pretty sure the sex organs function in people who are literally in a vegetative state. They certainly function fine in people with major developmental disabilities - it's a regular problem in the care of such individuals because they lack the mental capacity to understand the consequences of sex.\n\nNot sure what ur trying to argue here, seriously suggesting that if you stuck a male brain in a female body that the vagina would function perfectly? Srsly brah?\n",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "dkr2kqp",
            "speaker": "Chel_of_the_sea",
            "text": "&gt; You could use small un-peer reviewed studies\n\nThe first two are in the [peer-reviewed](https://en.wikipedia.org/wiki/Journal_of_Psychiatric_Research) *Journal of Psychiatric Research*, the last is published in freaking *Nature*, one of the biggest journals in the world.\n\n&gt; the fact is none of them found a tangible link between brain structure and gender dysphoria. If one did we'd all hear about it.\n\n...you just *did* 'hear about it', so evidently, that isn't true.\n\n&gt; Not sure what ur trying to argue here, seriously suggesting that if you stuck a male brain in a female body that the vagina would function perfectly?\n\nI mean, aside from the fact that we can't currently transplant a brain, yes, that is exactly what I am saying.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "dkr2yia",
            "speaker": "penismuncha",
            "text": "&gt;The first two are in the peer-reviewed Journal of Psychiatric Research\n\nAnd neither of them have been able to show a tangible reason why somebody would be trans.\n&gt;...you just did 'hear about it', so evidently, that isn't true.\n\nYou know what I meant brah. No need to be cheeky.\n&gt;I mean, aside from the fact that we can't currently transplant a brain, yes, that is exactly what I am saying.\n\nRight well this is straight up retarded. Female brains can't control a dick. They are not capable. Male brains have parts dedicated to controlling their dick, female brains do not because females do not have a dick. This is why it's so weird when trans claim to have a female brain when their brain can control their dick.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "dkr364j",
            "speaker": "Chel_of_the_sea",
            "text": "&gt; And neither of them have been able to show a tangible reason why somebody would be trans.\n\nI'm not sure why you would say that, since that is literally precisely what they did.\n\nWhat study do you think has \"shown a tangible reason why somebody would be gay\"? I'm having trouble following your standard of proof.\n\n&gt; You know what I meant brah. No need to be cheeky.\n\nYes, we wouldn't want to be cheeky, \"brah\".\n\n&gt; Female brains can't control a dick. They are not capable. Male brains have parts dedicated to controlling their dick, female brains do not because females do not have a dick.\n\nHate to break it to you, but the same nerves that innervate the penis in men innervate the clitoris in women. And no, you don't \"have parts dedicated\" to dick-control.",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "dkr3emf",
            "speaker": "penismuncha",
            "text": "&gt;\"shown a tangible reason why somebody would be gay\"?\n\nYou don't have to show a tangible tangible reason why when you can demonstrate its effects. Give a gay lad some gay porn and watch his dick get straight, boom proven.\n&gt;Hate to break it to you, but the same nerves that innervate the penis in men innervate the clitoris in women. And no, you don't \"have parts dedicated\" to dick-control.\n\nThis just isn't true tho, https://www.theguardian.com/science/brain-flapping/2013/dec/04/male-female-brains-real-differences",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "dkrf80k",
            "speaker": "bad__hombres",
            "text": "Yikes, I can't believe you actually read that and tried to pass it off as a source, that's kind of hilarious. Reading these comments gave me a headache, please tell me which part of your brain is the dick control center, because I somehow missed that in my three years of studying biology. ",
            "awry_utt": true
        }
    ],
    "dm87r1b": [
        {
            "utt_idx": 0,
            "utt_id": "dm87r1b",
            "speaker": "WeWuzKangzNShieet",
            "text": "I am interested how is T_D is harming the American democracy? By having other opinion than your own? Yes, they are a bunch of cringy fat kids that support Trump, make memes and have fun. They, by no means, endanger your so precious democracy. Also, if Reddit closes T_D this will cause big outrage. They are banning anyone with other opinion. So no, they don't do it only for the money. They do it not to become fascists and causing even more  people to like Trump and his fanbase.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "dm87vgv",
            "speaker": "MrDanger",
            "text": "&gt; Yes, they are a bunch of cringy fat kids that support Trump, make memes and have fun.\n\nSimply not true.\n\n&gt; not to become fascists\n\nA company self-censoring is not analogous to a government infringing on the rights of its citizens. This is the kind of nonsense arguments T_D makes, so you've answered your own question here.\n\nEDIT: Your understanding of the complexity of the situation would be better if you read the article I linked as background.\n\nhttps://qz.com/1056319/what-is-the-alt-right-a-linguistic-data-analysis-of-3-billion-reddit-comments-shows-a-disparate-group-that-is-quickly-uniting/",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "dm883im",
            "speaker": "WeWuzKangzNShieet",
            "text": "I stopped reading when they started spilling bullshit over 4chan. So tell me, how T_D and /pol/acks (including me) endanger your so precious democracy? And again, why should they censor T_D? Would you mind them if they were just people supporting Trump, which they actually are? You seem very intolerant of opinion. Now, because of you I went to T_D. There is absolutely nothing endangering democracy. I think you are just a little bit paranoid.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "dm88etv",
            "speaker": "MrDanger",
            "text": "Maybe I am. And maybe you're blind the results of the cooler-than-thou stupidity that goes on on 4chan, how it becomes automatic habit for many users. Much of the problem lies in people like you who see the more radical among you as being more like you than not. You're wrong.",
            "awry_utt": true
        },
        {
            "utt_idx": 4,
            "utt_id": "dm88hfa",
            "speaker": "WeWuzKangzNShieet",
            "text": "Answer my damn question. How is T_D killing your democracy? Or is it just hurting your feelings? Tell me, how am I endangering your democracy and freedom? What am I, russian hacker?",
            "awry_utt": true
        },
        {
            "utt_idx": 5,
            "utt_id": "dm88mgn",
            "speaker": "MrDanger",
            "text": "&gt; How is T_D killing your democracy?\n\nAlready did. Will again.\n\nIt's changing the way a large group of previously unconnected individuals think and uniting them. I take it you aren't a student of history, or you'd understand this is how the Nazis started, not with a website obviously, as did the Bolsheviks, and as the US Confederates did.\n\n&gt;hurting your feelings\n\nOdd you would attack that. Where did you get the notion people only behave when motivated that way? Betcha a dollar it's not original to you. You caught it, like a disease. We have a bad vector for that kind of habitual bullying on Reddit. It needs to go away.\n\nEDIT: Since you won't read the background material, you really can't have an informed, substantial discussion. Do that, and we'll talk.",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "dm88v3f",
            "speaker": "Akitten",
            "text": "Changing how people think peaceably is the point of democracy. As long as they aren't forcing anyone to change their mind, they are doing exactly what democracy encourages, convince others to their point of view to get it done.",
            "awry_utt": false
        },
        {
            "utt_idx": 7,
            "utt_id": "dm88z8q",
            "speaker": "MrDanger",
            "text": "&gt; peaceably \n\nThat's the operative word, isn't it. We're talking about the fine folks who helped organize Unite the Right.",
            "awry_utt": false
        },
        {
            "utt_idx": 8,
            "utt_id": "dm8953s",
            "speaker": "Akitten",
            "text": "Unite the Right was originally a peaceful protest. There was nothing in the plans that said \"run over people\". One dumb cunt going crazy and running over opponents should not make the whole movement violent, unless you are willing to call BLM a violent group based off more deaths and assaults happening during their events (The cop killer).",
            "awry_utt": false
        },
        {
            "utt_idx": 9,
            "utt_id": "dm89ds2",
            "speaker": "MrDanger",
            "text": "&gt; Unite the Right was originally a peaceful protest\n\nNonsense. But, let's say it was; how did it get out of control? Echo chambers like T_D, full of the kind of people who are willing to believe that crap and not smart enough to figure out they're being taken.\n\nI have no problems with the Bureau of Land Management.",
            "awry_utt": false
        }
    ],
    "dns7ugo": [
        {
            "utt_idx": 0,
            "utt_id": "dns7ugo",
            "speaker": "apricotasd9",
            "text": "Regarding 3.\n\nThe right wingers at charlottesville were Nazis. End of story. The organizer was alt right. He's since come out and called the victim a fat cunt who deserved it. The people at the rally were various breeds of alt right, which yes. The alt right are Nazis.\n\nLook, the rally was little more than 200 people. They were waving the Nazi flag, it was organized by Nazis, they were chanting nazi phrases and yelling about the jews being evil. They showed up with guns and body armor and attacked people. And they ultimately murdered an innocent in a terror attack.\n\nAnd Trump's response was to say some of them were good people, lie about liberals breaking the law, and blame the violence on the side that *didn't* show up in body armor and with guns.\n\n",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "dns9aty",
            "speaker": "Myphoneaccount9",
            "text": "This is more hyperbole, you should get a job in journalism\n\nTrump said there are good people on both sides and condemns all violence.\n\n",
            "awry_utt": true
        }
    ],
    "duewpnl": [
        {
            "utt_idx": 0,
            "utt_id": "duewpnl",
            "speaker": "XXX69694206969XXX",
            "text": "&gt;The reason I believe this is because guns, unlike most other artifacts, are fundamentally instruments of violence and death.\n\nExcept for all the non-violent non-killing things you can do with guns.\n\n&gt;However at their core, they are undeniably death machines.\n\nIf that were true then guns couldn't be used without killing.  \n\n&gt;There is simply no other way to see them.\n\nYes there is. \n\n&gt;I believe that to love death is perverse\n\nThat's just, like, your opinion, man.  ",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "duexla6",
            "speaker": "cryptoskeptik",
            "text": "Since you don't seem very sincere in your responses I'm not going to give this comment much time, however I will respond to quickly this:\n\n&gt; That's just, like, your opinion, man.\n\nA definition of perverse: \"deviating from what is good\". Do you believe death is good?",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "dueypbh",
            "speaker": "mysundayscheming",
            "text": "Death is good. Perhaps not untimely death or violet death, but the concept of death. Nothing should live forever or there will never be enough room for what comes next. And even in fantasy universes the immortal beings often long for mortal passion and immediacy. Though there are many ways I would prefer not to die, I would never voluntarily live forever. ",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "duf0vex",
            "speaker": "cryptoskeptik",
            "text": "&gt; Death is good. Perhaps not untimely death\n\nAh, guns. Which only bring timely death.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "duf13ch",
            "speaker": "mysundayscheming",
            "text": "I was not debating guns. You said \n\n&gt;A definition of perverse: \"deviating from what is good\". Do you believe death is good?\n\nAsking if death was good, in order to suggest any fondness or respect for death was a perversion.  It isn't. I firmly believe death is good. Death is not a deviation from the good. It is not a perversion. Guns may bring about death that is unwanted, but death itself is not evil or wrong. Your beef isn't with the concept of death. Death isn't perverted. ",
            "awry_utt": false
        }
    ],
    "dutiyfo": [
        {
            "utt_idx": 0,
            "utt_id": "dutiyfo",
            "speaker": "I_Poop_On_Birds",
            "text": "U do realize it was a more savage and brutal time back then right?... Hell imagine if we resolved disputes today with pistol duels... ur a silly nilly OP",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "dutl6eu",
            "speaker": "duckandcover",
            "text": "Imagine if people resolved their issues with arsenals.   Kidding. We don't have to imagine. ",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "dutlaep",
            "speaker": "I_Poop_On_Birds",
            "text": "If u don’t like it move to a place that fits ur ideals",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "dutlkfa",
            "speaker": "duckandcover",
            "text": "Welcome to democracy.  Deal with it (hopefully using your voice vs your guns)",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "dutlnnl",
            "speaker": "I_Poop_On_Birds",
            "text": "Ok fair enough... enjoy the fact that what u propose will NEVER happen! :) ",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "dutp8pb",
            "speaker": "duckandcover",
            "text": "I imagine not within my lifetime.  I'm getting close to 60.  But if we have never ending school shootings the kids that will grow up over the next few generations might very well do that.  You want to see what that looks like just look what Parkland kids are doing.  Damn they're good.\n\nIt's kind of ironic.  If SCOTUS hadn't broadened the interpretation of the 2nd Amendment making this problem so hard to address, it would be addressed and the 2nd Amendment would actually be in less danger.",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "dutpqn1",
            "speaker": "I_Poop_On_Birds",
            "text": "The kids at Parkland are being exploited and are pawns... ppl from a tragedy should never make policy decisions because that’s how irrational decisions are made",
            "awry_utt": false
        }
    ],
    "ecle8by": [
        {
            "utt_idx": 0,
            "utt_id": "ecle8by",
            "speaker": "Cortexion",
            "text": "I'm sorry, but people who think lab grown meat is a \"thing\" unfortunately have little experience in biological cell culture and have only been duped by reading non-scientific articles in newspapers like The New York Times and magazines like Wired about it. Maybe someone from the industry can correct me, but here's why I think it's (currently) BS due to the limitations of 2D cell culture, cell doubling time, reagent cost, and reagent sourcing.\n\n&amp;#x200B;\n\nThe #1 problem with lab grown meat is the throughput of standard cell culture techniques used by every biology lab around the world. All these labs are growing their cells on [flasks of various sizes](https://www.usascientific.com/productimages/greiner/main/advanced-tc-filter-flasks-m.jpg) but a very common one is a T75 flask, meaning it has 75 cm^(2) on which to culture cells. From a single T75 flask you can maybe get a max of 10 million cells, and that's pushing it. 10 million cells may sound like a lot, but consider that the average person is around 75 trillion cells, and you can start to see a problem. The sheer number of cells to even make a \\*single\\* patty is on the scale of billions of cells. Since 1 billion cells roughly fills up a 50 mL tube, I'd say a decent single patty requires around 2 billion cells - so 200 standard T75 flasks for one patty. A \\*typical\\* student or researcher is going to be changing cell media in anywhere from 1-20 flasks for his or her research. A full time lab tech who is paid by a department may be taking care of many many more flasks at a time for something like stem cell culture, but you only bother to hire a lab tech when you have so many dozens to hundreds of flasks to take care of that it would prevent your PhD students from getting any actual research done other than changing cell media. So producing just \\*one patty\\* of 2 billion cells from 200 flasks is basically going to require that you hire a full time lab tech to take care of the cells and grow them.\n\n&amp;#x200B;\n\nLet's say you're serious about growing this patty and you ditch the T75 flasks and get something more efficient like a [cell factory](https://assets.thermofisher.com/TFS-Assets/LCD/product-images/LC-120300-NuncCO2-Incubator_04.tif-650.jpg) where you just stack larger flasks in a gigantic incubator. Doing that still won't change current limitations of 2D culture, cell doubling time, reagent cost and reagent source. Since we still culture cells in 2D, it's horribly inefficient in comparison to growing cells in 3D, greatly limiting the efficiency and yield. So why don't we just grow our cells in 3D? After all it'd help all biologists to have billions of cells to work with instead of millions, right? The problem here is the diffusion of oxygen to cells in the flasks. The typical distance thrown around for the diffusion limit of oxygen is 200 microns. Beyond this distance oxygen cannot diffuse far enough to keep cells alive and you need vasculature like capillaries to be carrying oxygen to your cells. So if you want to start culturing cells in 3D in \"tissues\" thicker that just 1/5 of a mm deep, you need to be creating some sort of vasculature to provide your cells with oxygen and nutrients. Creating 3D vasculature for cells is my area of research, so all I can say is good luck doing that on a massive scale.\n\n&amp;#x200B;\n\nLet's say you've got the cell factory, lab tech, and have maybe even found a way to start culturing cells in roughly 3D volumes, awesome! That won't change the doubling time of your cells, or the cost of your reagents or your reagent source. Cells can only multiply so quickly to fill up your culture flasks. A C2C12 cell (a super common mouse muscle cell) doubles roughly every 12 hours. So currently every couple of days you need to take that one full flask of cells and \"split it\" into, say, 4 flasks of cells to give them more room to grow. If you find a way to lower the doubling time of the cells, you are going to have to be \"splitting\" your cells into flasks even more frequently, which takes more time than just changing the cell media you're feeding them with.\n\n&amp;#x200B;\n\nLet's say you've got the cell factory, lab tech, have found a way to start culturing cells in roughly 3D volumes and have a cell line with a really fast doubling time. That won't change the cost of your reagents or your reagent source. So all those flasks you were growing your cells in require cell media. Cell media is just the broth that contains crucial proteins and nutrients cells need to grown outside of a normal body. As cells proliferate, they consume the nutrients in the media, turn it acidic and need it changed every so often. It's basically food and a diaper in one. You need to provide the cells with food, and you can't let the media get too acidic (dirty) so it needs to be changed. The problem with all of this cell culture stuff is that cell media is expensive. A single T75 flask takes maybe 20 mL of cell media at a time. So to get your 2 billion cells from 200 T75 flasks, you need 4L of media just to start the experiment. Around 500 mL of [C2C12 cell media](https://bioscience.lonza.com/lonza_bs/US/en/Primary-and-Stem-Cells/p/000000000000185301/SkGM-Skeletal-Muscle-Cell-Growth-Medium-BulletKit) is going to run you at least $160, maybe less if you order in bulk as a company, but either way for your first round of cell media you're looking at 8 x $160 = $1280 for your first 4L of cell media. Keep in mind you'll probably have have to change this media at least once while your cells are doubling in all those flasks, so make it $2560. Throw in your tech's salary, CO2 costs, electricity costs to run your incubators and you're looking at maybe another $1000. **So it's \\~$3500 just to get your single patty.**\n\n&amp;#x200B;\n\nLet's say you've got the cell factory, lab tech, have found a way to start culturing cells in roughly 3D volumes, have a cell line with a really fast doubling time and are okay paying a lot for cell media. This doesn't change **the ultimate final problem** **with cell culture - it depends on the slaughterhouse industry to even exist.** What am I talking about, you ask? Well where did you think all that cell media came from? One of the most crucial reagents in cell culture is [Fetal Bovine Serum (FBS)](https://en.wikipedia.org/wiki/Fetal_bovine_serum). It is literally the blood taken from an unborn calf whose mother was slaughtered. Serum is the fluid component of blood that contains all those small proteins needed to culture cells, and a developing fetus contains loads of those precious, precious proteins. So to even have started this experiment you were indirectly buying the blood of unborn cows to even get to your patty and therein lies the ultimate irony - **the lab grown meat industry needs to industrial slaughter industry to even exist.**\n\n&amp;#x200B;\n\nOn to your point of \" If this tech was prioritized and funded I can see a more sustainable agriculture future for humanity.\" The problem is is that this tech is and has always been prioritized by biologists ever since we started culturing cells decades ago. Additionally, it has always been \"funded\" but how much (more) is needed? Well it's difficult to say. Scientific research is slow. You do not necessarily solve problem A faster by throwing more money at it. This is because problem A is also dependent on current limitations of technology B. And technology B is hindered by limitations in method C. All these fields of scientific research are intertwined so typically an advance in one technology has a positive ripple effect into other areas. The downside to this is that even if you spend 10x more money on cell culture research than you currently are, you are not going to solve all the associated problems of cell culture. The thought that you can throw more money at research and solve all problems faster is to assume 9 pregnant women can produce a baby in 1 month. It is simply not true.\n\n&amp;#x200B;\n\nWhat \\*could\\* make lab grown meat possible? Finding a way to produce all of those proteins like FBS \\*in vitro\\* just like we produce insulin for diabetics with modified bacteria. If there was a company that was able to produce cell culture media without the need for FBS, or found a way to make FBS synthetically, I would invest in it. That company would then provide at least one of the key limiting reagents needed for cell culture. But you're not going to see a NYT article about \"company creates synthetic FBS substitute\" because no one outside of the field would know what that is and what it implies. It is instead far more easy for the NYT or Wired to go to one of these \"lab grown meat\" companies, look at all their culture flasks and say \"wow this is the future\". Well it's currently not the future in my eyes, it's just a very time and cost inefficient way of growing you one patty and until the handful of limitations I mentioned above are addressed, it will continue to be BS.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ecm3xyh",
            "speaker": "The_Beer_Engineer",
            "text": "So if cells double in 12 hours, the total target for the cell quantity you need to have in the system at any one time is the local consumption in any given 12 hour period in the area that you are growing for. Say you own South Texas Clean Meat company which grows and distributes meats to 10,000,000 people who consume on average 200grams every 12 hours, you’d need around 2,000 tonnes of culture ‘brewing’ at any time, producing 2,000 tonnes of meat every 12 hours. You could probably do this in a single large facility and although not specified in your post i am going to assume it would consume roughly 4000 tonnes of ‘feed’ per 2000 tonnes created. \n\nConsider then for a moment what this replaces. Let’s break it down as:\n500 tonnes of chicken, 500 tonnes Lamb, 1000 tonnes beef. \n\nAt 1kg meat per chicken, this is 500,000 chickens every 12 hours or 1,000,000 per day. Meat chickens take roughly 40 days to grow, process and distribute meaning you’d need 40,000,000 chickens in the pipeline. At 10,000 chickens per hectare (free range) this is 4,000HA of land. At 115g of food per chicken per day, you also need 4,600Tonnes of chicken food per day or around 9.2kg of feed per kg of meat produced. You also have to manage around 4,000 tonnes of guano per day and dispose of 1,000,000 carcasses. \n\nFor beef, to produce 1,000 tonnes per 12 hours, and assuming an average of age of 2 years and weight of 1000kg at slaughter, producing roughly 500kg of saleable meat in various cuts you need 4,000 beasts per day with around 3,000,000 in the pipeline. Each consumes 3% of its bodyweight in food per day so you need around 45,000 tonnes of feed per day to produce that beef (possibly more, as I have assumed linear growth from 0 to 1000kg over 2 years). Assuming they all live on feedlots (yes I know, many are grass fed, but this brings its own issues) and are stocked at around 500 per hectare you need 6,000 hectares of land. You also have to handle 40,000 tonnes of cow pat and 4,000 carcasses per day. This is currently dumped in rivers and streams at huge cost to the environment. \n\nJust to reiterate, we feed chickens 9.2 times as much grain as they produce in meat and cows 23 times as much grain as they produce in meat!!\n\nThis new meat is so much more efficient at scale that we only harm ourselves by _not_ throwing money at solving the problems you raise (some of which I would wager are already solved). I love eating animal but if I could have the same taste and nutrition without the slaughter? FUCK YES. Maybe lab grown meat isn’t much of a thing today, but it is definitely the future of meat. All I can say is if you’re not solving the problems, get out of the way. \n\n",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "ecmdka8",
            "speaker": "Crankyshaft",
            "text": "You didn't address a single one of the technical hurdles /u/Cortexion mentioned, you just fire-hosed a bunch of numbers of what might be possible if the technology actually worked. You should stick to beer and shitty cryptocurrency \"investments.\"",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "ecmevtm",
            "speaker": "The_Beer_Engineer",
            "text": "Lol I was just stating the opportunity. You have no idea who I am or what I do. You’ll see me around. ",
            "awry_utt": true
        }
    ],
    "eczpqst": [
        {
            "utt_idx": 0,
            "utt_id": "eczpqst",
            "speaker": "RevolutionTodayv2",
            "text": "More pseudointellectuals trying to cloak their racism under a guise of academic civility.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ed0ox5h",
            "speaker": "Emijah1",
            "text": "Fight on pseudorevolutionary!",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "ed1awi4",
            "speaker": "RevolutionTodayv2",
            "text": "It's obvious you're an uneducated \"race realist\" that refuses to let go of debunked racist talking points that are decades old already. Have fun with your pseudoscience!",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "ed1c9kl",
            "speaker": "Emijah1",
            "text": "Yeah you got all the labels and categories worked out buddy!\n\nIt takes two to read the old two party script though my friend.  So I’ll go next:\n\nDebunked where now?\n\nPS:  you realize this post was not focused on Race/IQ, right?",
            "awry_utt": true
        },
        {
            "utt_idx": 4,
            "utt_id": "ed1ehw8",
            "speaker": "RevolutionTodayv2",
            "text": "Where is you evidence of a \n\"social justice takeover\" within academia?\n\n\n",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "ed1ep3b",
            "speaker": "Emijah1",
            "text": "Well, I presented my arguments and supporting docs in the post.  Happy to discuss further if you like.",
            "awry_utt": false
        }
    ],
    "eeh56ic": [
        {
            "utt_idx": 0,
            "utt_id": "eeh56ic",
            "speaker": "proudvet111",
            "text": "Brain washed is the term describing those who Trump has convinced that LADDERS AND SHOVELS DON'T WORK TO DEFEAT A WALL.  Argue that, tell me how they won't work, or haven't worked for thousands of years, go ahead!\n\nI expect crickets, hopefully not.\n\n&amp;#x200B;",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "eeh5fp6",
            "speaker": "retroactive_sleep",
            "text": "You're astoundingly clueless. It's 2019 you're living in WW1 buddy",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "eehu9ku",
            "speaker": "proudvet111",
            "text": "That's not an argument, that's just you giving up.  Thanks for making my point.  \n",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "eehuwcu",
            "speaker": "retroactive_sleep",
            "text": "Nah dude you think it's WW1",
            "awry_utt": true
        },
        {
            "utt_idx": 4,
            "utt_id": "efappwc",
            "speaker": "proudvet111",
            "text": "No, I know the date and time, It is NOT WWI, again I see that you cannot argue intelligently about the effectiveness of ladders and shovels, concentrate and picture a long ladder with people climbing over the wall, can you see it?\n\nGood, now that you can visualize that, picture them climbing down the other side, now you got it. BOOM&gt;\n\nProud of you and this is a fine day to learn about history, walls don't work, never have, never will. Nancy is way smarter than the Coward in Chief, as she has him on his knees, he folded on the shutdown, that proof.    ",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "efaug2t",
            "speaker": "retroactive_sleep",
            "text": "Lmfao dude you're living in World War 1. No shit you can climb over any wall good job now use that brilliant imagination of yours to consider a technology that could limit the effectiveness of said blankets and ladders. Just because there's waye over, under, and through walls doesn't mean they aren't a deterrent. Pelosi is a corrupt sellout, she's the least popular politician in the nation for a damn good reason. ",
            "awry_utt": false
        }
    ],
    "ehmmpt7": [
        {
            "utt_idx": 0,
            "utt_id": "ehmmpt7",
            "speaker": "chilloutdude2018",
            "text": "**This is a play straight out of the Trump/Fox News camp.**\n\nI know, I literally studied their comments/mindset for two straight years.\n\n**The mindset behind them hating college for all is that they believe minorities are unworthy of college** and it would hurt white people's place in society since they believe only whites should be on top.\n\n**The two top creators of crime and poverty are broken homes (lack of father) and lack of college education.**\n\n**Last year, the US spent 700 BILLION of our tax dollars on war**. On stinkin war. \n\nI estimate **it would cost around 15-20 billion annually to put every high school graduate through 2-4 year college**. \n\nThat's nothing compared to what we spend on war.\n\nWar has done nothing but bankrupt the country and ruin the US's reputation in the world.\n\nCollege for all would be an investment that would pay off through American IQ rising and less crime and poverty.\n\n**That is OUR MONEY** after all and it should go towards building us. Not disappear overseas.\n\nI've thought of **condensing high school curriculums** to **have students start and finish with a college degree** as well as study **personal finances, entrepreneurship, real estate investing, economics, law, personal training and nutrition and Tactical Combat Casualty Care Self/Buddy aid** (just in case shot, stabbed or injured) but making college free in the 'richest' and most 'free' country only seems commonsense.\n\n**Don't politicize progress and commonsense.** ",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ehmtpi7",
            "speaker": "liquidsnakex",
            "text": "Calm down with the bolded text, your comment reads like that timecube shit. Bolding is for drawing attention to one or two phrases, not every second line.",
            "awry_utt": true
        }
    ],
    "ek10klr": [
        {
            "utt_idx": 0,
            "utt_id": "ek10klr",
            "speaker": "toldyaso",
            "text": "1. It's a joke.\n\nAnd for 2... \"Creating echo chambers doesn't work\" There's a difference between making an attempt at preventing whitey from co-opting and appropriating yet another piece of black intellectual property, vs. creating an echo chamber.\n\n\"Segregation doesn't work\" Sometimes you have to segregate yourself from your oppressors.  Like if I'm running from the guards at a concentration camp, I'm trying to segregate myself from them.\n\n\"Deciding that what matters about a person is their skin color rather than their thoughts, feelings, and conduct is racist and it DOESN'T WORK\"\n\nThat's not what racism is.  Racism is the belief that some races are inherently better or worse than other races.  Black people are a racial minority, they have historically been isolated and kept separate, and they are still oppressed today.  It's not unreasonable for them to want to carve out a little space for themselves, where they don't have to spend half their time explaining shit to whitey, or defending themselves against accusations.\n\n\" Racial equality can never happen if we are unwilling to look past race and interact with each other as humans first, and as white or black humans last\"\n\nWho bears more fucking responsibility to end racism?  White people, or black people?  We put the problem on them, it's BS to say that now that we've created this massive problem which benefited us, at their expense... that now it's time for us to all equally bear the burden of removing it.\n\n\"but overwhelmingly the tendency has been that I've had insightful conversations with passionate black people on that sub that resulted in me having a better understanding of them as a person\"\n\nAgain, it's not their fucking responsibility to educate  you about racism or black people in general.  Read a book, take some classes.  They deserve to have a space where they can do their thing, without having to devote half their time and energy to teaching, bickering, explaining, etc.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ek18dr7",
            "speaker": "schlamboozle",
            "text": "It's on private and requires accepted verification on bptmeta or an apology for being born white. Where's the joke?",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "ek18y4u",
            "speaker": "toldyaso",
            "text": "Cmon, that's just funny.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "ek192gy",
            "speaker": "schlamboozle",
            "text": "It's pathetic and sad not funny. ",
            "awry_utt": true
        },
        {
            "utt_idx": 4,
            "utt_id": "ek19vz1",
            "speaker": "toldyaso",
            "text": "I'd argue that your'e only making it even funnier.",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "ek1a7wz",
            "speaker": "schlamboozle",
            "text": "You've got some piss poor logic then. Racism isn't funny no matter what color it is. ",
            "awry_utt": true
        },
        {
            "utt_idx": 6,
            "utt_id": "ek1b5a8",
            "speaker": "toldyaso",
            "text": "I made a deliberately inflamatory remark here to troll this guy",
            "awry_utt": false
        },
        {
            "utt_idx": 7,
            "utt_id": "ek1d5g1",
            "speaker": "jmomcc",
            "text": "They can be racist. They just suffer ALOT more from institutional racism. It’s definitely possible for a black person to be racist though. ",
            "awry_utt": false
        }
    ],
    "emwwj63": [
        {
            "utt_idx": 0,
            "utt_id": "emwwj63",
            "speaker": "Ahkileez",
            "text": "Outside of very specific medical situations (including psychological) or historical cultural/religious rites, nobody needs to use what we currently consider to be recreational drugs. Nobody. Just don't use drugs. \n\nIf you have to get your happiness from a bottle or a bush or a beaker, you're pathetic. \n\nThe only reason to legalize these drugs is to indulge weakness and bad decisions.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "emxcta3",
            "speaker": "mooncow-pie",
            "text": "So, that means if you have a beer with your friends, you're fucking pathetic?",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "emxdke4",
            "speaker": "Ahkileez",
            "text": "Yes. How is that beer enhancing that experience? How is it going to deepen the emotional bond between you or help you hear when your friend is telling you something profound or really personal. It's not even helping you make memories since if you drink enough you won't remember anything at all.\n\nPathetic all around. \n\nSocial lubricant my ass. \n\nAll it is is liquid disinhibition. Inhibitions are generally good things. But in case they are a social impediment for you that's something you need to put real, important introspective work into for growth. Finding a shortcut through a bottle is pathetic in the extreme.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "emxdrf5",
            "speaker": "mooncow-pie",
            "text": "I'm sure you've *never* indulged in anything that changed your mood, or reduced your inhibitions. And I'm not talking about drugs.",
            "awry_utt": true
        }
    ],
    "eq804q3": [
        {
            "utt_idx": 0,
            "utt_id": "eq804q3",
            "speaker": "itstoffer",
            "text": "You’re assuming vegans don’t supplement their diet in other ways.\n\nYou’re also presenting studies that day this causes this, where this isn’t a vegan diet.\n\nYou’re saying all vegans are this (which, you know isn’t backed up by anything) so this applies to them.\n\nDr. Garth Davis. Look him up. Went vegan not for animals, but because of all his research and studies into health and diet that he did as the head of Memorial Hermann.\n\nI mean, there’s a ton of studies that say vegan diets cause these good things which I would way higher than the assumptions you made.\n\nI’m not a vegan, but I’m smart enough to know that the animals we are most closely related to are chimps and their entire diet is less than 5% meat.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "eq80qf3",
            "speaker": "jenknigg",
            "text": "Obviously supplementing isn’t that easy, considering how common it is for vegans to be malnourished. Also nutrients in multivitamins are not as bioavailable.\n\nAnd really I don’t care what any doctor says I feel so much better when I eat meat for every meal. Humans evolved to eat meat. We evolved to hunt other animals. It’s undeniable. I will continue to eat what I evolved to eat for millions of years thank you very much. \n\n\nPs that chimp argument makes zero sense lmao, chimps are not hunters like humans are  lmao why do you think humans evolved to Throw so hard and run so far, so we can chase and kill large animals with projectiles!",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "eq80ytg",
            "speaker": "itstoffer",
            "text": "1. There is no evidence of that. \n2. Of course you don’t. Is that what you really look like? The post you made with two cheerleaders that could fit inside of you with room to spare (just like I assume you could)\n4. I don’t think you understand how evolution works.\n3. No, it’s really not.",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "eq81mp6",
            "speaker": "jenknigg",
            "text": "If vegan diet is so healthy why do the majority go back to eating meat huh",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "eq81po6",
            "speaker": "itstoffer",
            "text": "1. Data. Show it.\n2. If not eating candy is so healthy why do people go back to eating candy?",
            "awry_utt": false
        }
    ],
    "ew0d7fh": [
        {
            "utt_idx": 0,
            "utt_id": "ew0d7fh",
            "speaker": "edwardlleandre",
            "text": "..women[ have a subconscious wish for brutal male domination](https://twitter.com/S_Saeen/status/955889027957297152)\n\n..that it’s unfortunate that men can’t control women who say crazy things because[ they aren't allowed to hit them](https://thevarsity.ca/2017/10/08/jordan-peterson-i-dont-think-that-men-can-control-crazy-women/)\n\n..women who don’t want to be harassed at work[ but wear make up are being \"hypocritical\"](https://twitter.com/classiclib3ral/status/961461529555210240)\n\n..young women are [outraged because they don't have a baby to suckle](https://twitter.com/jordanbpeterson/status/913531363915128832?lang=en)\n\n..if a woman doesn’t want to have kids,[ there's something wrong with her](https://www.youtube.com/watch?t=7m30s&amp;v=NV2yvI4Id9Q)\n\n..and says [“The idea that women were oppressed throughout history is an appalling theory.”](https://torontolife.com/city/u-t-professor-sparked-vicious-battle-gender-neutral-pronouns/) \\- despite women lacking basic human rights and legally being owned by men throughout history\n\n..says stuff like “Men cannot oppose pathological women because chivalry demands they keep their most potent weapons sheathed” on twitter  \n\n\nI can go on, if you'd like.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ew0ecxs",
            "speaker": "GameOfSchemes",
            "text": "&gt;despite women lacking basic human rights and legally being owned by men throughout history\n\nBy this argumentation, a majority of men also lacked basic human rights and were legally owned by others throughout history. Guess I can call you sexist if you think that's an appalling theory.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "ew0f5l2",
            "speaker": "edwardlleandre",
            "text": "Mmm, just taste the false equivalency there.\n\nI'd like to point out that you didn't actually dispute the point. Because you can't. We're only two weeks and a year away from the 100th anniversary of women's suffrage in the United States. We have never had a female president. There are nearly as many currently elected republican senators as there have been total female senators in the history of the republic. \n\nLess than fifty years ago is was **legal to rape your wife**.\n\nYou know that Peterson is full of shit in that quote, but rather than actually engage with reality, you throw out a non-sequitur, arguing 'well men have also been treated shitty throughout history'.\n\nYeah, sure, this is true. Black people in the states, for example have plenty of reasons to complain. And if Jordan Peterson were saying \"The idea that black people were oppressed throughout US history is an appalling theory\" I'd be calling him on that stupid bullshit too.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "ew0fh8d",
            "speaker": "GameOfSchemes",
            "text": "&gt;Mmm, just taste the false equivalency there.\n\nMmm i can just taste the non-sequitur from here. Seriously, what kind of argument is that? You're gonna have to engage me a little kinder than that if you want to have a discussion. Nonetheless, I'll even go so far as to cite Argument from Fallacy here. \n\nYou can cite your typical talking points all you want, that doesn't make your logic any tighter. It's water-tight, and I revealed that. \n\n&gt;You know that Peterson is full of shit in that quote\n\nPlease, tell me more about what I know. What else do I know? \n\n&gt;rather than actually engage with reality, you throw out a non-sequitur, arguing 'well men have also been treated shitty throughout history'.\n\nNo, i was demonstrating the fault in your logic. Take a step back and realize that. Or should I perhaps instead say \"you know I was engaging in reality, but instead you opt to strawman the argument going on an emotional tirade.\"",
            "awry_utt": false
        }
    ],
    "exlodys": [
        {
            "utt_idx": 0,
            "utt_id": "exlodys",
            "speaker": "nanorhyno",
            "text": "These ponderances are so absurd. First of all, the world doesn't give a flying f@ck about alcohol consumption. If you mean society or humans, then it is quite a bit more difficult. Posting something this broad is just a way to justify an outrageous, impossible ideal. \n\nHow can I say this? This literally applies to almost everything we do. Why not just get rid of steel, processed foods, or the human brain? All of them are tied to unneeded death and arent necessary for the world to continue. \n\nFor goodness sake, get rid of humans. We arent all that great for the \"world\". We cause untold amounts of death inside and outside of our species that is unnecessary ever day.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "exm70nl",
            "speaker": "Chasicle",
            "text": "The pros of your examples vastly outweigh the cons.  Try reading the post without jumping to conclusions.",
            "awry_utt": true
        }
    ],
    "f6f9tgz": [
        {
            "utt_idx": 0,
            "utt_id": "f6f9tgz",
            "speaker": "LibertyUnderpants",
            "text": "No.\n\nThe massive political divide we are currently seeing is because in every era, 1/3 of the population have to be dragged kicking and screaming along the road of progress. \n\nThe politicians are as fault as far as some of them (Democrats/progressives/liberals) insist on things like equal rights for minorities/LGBTQA+ people/women, smart gun control, bodily autonomy, immigration reform, higher taxes on the wealthiest 1% and large corporations, caring for the environment, addressing climate change etc, and other politicians (Republicans/conservatives) pander to the lowest of the low by insisting that they have the right to trash the environment, ignore climate change, give huge tax breaks to the 1% and huge corporations, vilifying poor people who need social safety net programs like food stamps, and basically being racist, white nationalist cunts. \n\nThe Republicans/conservatives are LYING to their base and convincing people who are often poor and ignorant to vote and speak out against their own interests because racism is okey-dokey as long as you don't want healthcare or anything else liberals say you should want. Because those damn dirty liberals think your son should be able to wear dresses if that's what he wants, and did you know they also kill and eat babies and don't want you to be able to call black people niggers? \n\nYeah. If you want to be blaming politicians, look no further than the garbage heap that is the GOP.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "f6fmd6p",
            "speaker": "Csauter36",
            "text": "What are you even talking about. My God",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "f6fxmo5",
            "speaker": "comfortablesexuality",
            "text": "He's just outlaying how the 'both sides' argument is nonsense",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "f6g1cq0",
            "speaker": "Csauter36",
            "text": "No, they are outlaying how they have put zero effort into knowing what the opposite arguments to their beliefs are. That was paragraphs of absolute nonsense.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "f6jlhlk",
            "speaker": "RemoveTheTop",
            "text": "&gt; what the opposite arguments to their beliefs are.\n\nI mean what was incorrect about what they said instead of just pearl-clutching that they dared say what they said?",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "f6jp5rx",
            "speaker": "Csauter36",
            "text": "  I'd suggest learning for yourself what opposing views are and not just taking other like-minded folks word for it. I'm not here to do your research.",
            "awry_utt": false
        }
    ],
    "ffiv3u9": [
        {
            "utt_idx": 0,
            "utt_id": "ffiv3u9",
            "speaker": "pLaxton__",
            "text": "Two things.\n\n1.\n\nIt's OK to objectify both men and women. We do it in our minds every day anyway and it would be unnatural to try to stop it.\n\n2.\n\nMind your business. You don't know these people. No one is asking you to stick up for them.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ffivh19",
            "speaker": "iminlovewithmolly",
            "text": "There’s an irony in telling me to mind my own business in a CMV thread about people who take pictures of others without their consent and put the on IG.",
            "awry_utt": true
        }
    ],
    "ffko5be": [
        {
            "utt_idx": 0,
            "utt_id": "ffko5be",
            "speaker": "Nyeaheh123",
            "text": "Based off your post history you seem like an incel. I'm not tryna roast, go see a therapist.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ffkpiwb",
            "speaker": "DavutOzkan53",
            "text": "I ain’t an incel.  I‘m a bigot.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "ffkq0r5",
            "speaker": "Nyeaheh123",
            "text": "Why are you a bigot?",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "ffkqrox",
            "speaker": "DavutOzkan53",
            "text": "I’m a bigot who hates people for their opinions.  That‘s the only type of bigotry I engage in.",
            "awry_utt": true
        }
    ],
    "fheakvw": [
        {
            "utt_idx": 0,
            "utt_id": "fheakvw",
            "speaker": "HobieSnacks",
            "text": "what if I told you science has been wrong before and it can be wrong again. mutilating your body to make you think you're a different sex is insane.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "fhek33k",
            "speaker": "bdubble",
            "text": "&gt; mutilating your body to make you think you're a different sex is insane\n\nThat's your \"feels\", get over it.",
            "awry_utt": true
        }
    ],
    "fsj1v1l": [
        {
            "utt_idx": 0,
            "utt_id": "fsj1v1l",
            "speaker": "GastonsChin",
            "text": "Imagine someone kidnapped you, beat you, raped you, enslaved you, and tortured you for 250 years and then got on your ass for having an attitude about it ...",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "fsj2n8b",
            "speaker": "NoTornadoTalk",
            "text": "Yep, how many black people today have had this happen to them? How many other races and cultures have had this happen to them and somehow they're ALL doing better? \n\nThink about what you're actually saying ffs.",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "fsj46de",
            "speaker": "GastonsChin",
            "text": "... What?\n\nNevermind. Don't talk anymore.",
            "awry_utt": true
        }
    ],
    "fstb0se": [
        {
            "utt_idx": 0,
            "utt_id": "fstb0se",
            "speaker": "jellyman52",
            "text": "First off a lot of the people who use that phrase probably don’t see it the way I do. All lives matter means to me that this isn’t a race or person specific problem. Because police brutality affects all races, and when I a white man see people say black lives matter and hear them talk like somehow it’s my fault. I have to say something to protest both the police brutality and the gross demonization of white men. When I hear people I thought were friends say I’m privileged and part of the problem. Even though they know damn well they had better upbringings, more money, and more opportunities, it puts some fire in me. Plus we both know if George Floyd was white nobody would have given a shit. And if someone decided to protest by saying white lives matter they would have been labeled a neo-nazi, even though many more white people are killed by police than blacks.\n\nThere is a huge divide between white and black culture in America. And if white men In particular aren’t willing to suck the dick of the black community they racist nazis. That’s not something I’m willing to stand for, I will stand for all lives and equality of opportunity for all people. All the progress we have made towards that is blatantly ignored. Over the last 20 years police shootings have dropped quite a bit especially when comes to blacks. Black people have more opportunities than ever. And that brings me back to my poor black “friend” who thinks I’m privileged. I scored higher on every part of the ACT than him, was a much better student in high school while he barely graduated. Yet when we both applied to the same school for the same major, he gets accepted and a scholarship, and I get declined. So yeah I think blacks need to stop using the victim mentality and realize that 99.99999% of white people don’t care that your black and could even be your friend. And that they have so many opportunities these days. The majority of there problems comes from there own culture holding them back not other cultures.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "fstgrhr",
            "speaker": "nintenpawg",
            "text": "you're only proving op's point. all lives matter is only used when white people are feeling attacked even though black lives matter isn't demonizing white people? just uplifting black people 🤔",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "fstj0s0",
            "speaker": "jellyman52",
            "text": "You’re only proving my point. Black lives matter is only used when black people are feeling attacked even though all lives matter isn’t demonizing black people? Just uplifting all people🤔\n\nYour point is silly BLM has a track record of demonizing white people. If you want I could link a few of the thousands of examples of this. And they never say what they want just to stop racism. How about they stop saying black culture is perfect and doesn’t turn out kid after kid who thinks they need to be a thug or gangster to be accepted. And actually purpose bills that would make a difference, and take steps to clean up there own community which are gunning down there brothers and sisters at increasing rates.\n\nAnd like I said they just ignore all the progress made towards equality. And say politicians are racist even if they are passing bills to help black communities. \n\nAlso it’s not feeling attacked it is being attacked. Black on white crime is around 10x higher than white on black crime I believe, once again I can throw down 100’s of links if that would be appreciated. Because all people should be fighting for all peoples right to life liberty and justice.",
            "awry_utt": false
        }
    ],
    "fv2s15x": [
        {
            "utt_idx": 0,
            "utt_id": "fv2s15x",
            "speaker": "ReservoirRed",
            "text": "Do you really want Americans to become even more uncultured?\n\nYou guys are literally a meme",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "fv2smsc",
            "speaker": "[deleted]",
            "text": "Didn’t need such an insult. I imagine your not even American. Just because I don’t speak Italian doesn’t mean I can be involved in Italian culture.",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "fv2teuo",
            "speaker": "ReservoirRed",
            "text": "Lol, what gave it away? \n\nAnd mate, most of US citizens can't even find Italy on the map. The more they're forced to acknowledge the existence of the world outside the US the better.",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "fv2tiak",
            "speaker": "[deleted]",
            "text": "That should be solved by geography class. I admit, we Americans are quite oblivious to the word. That’s fine though, we are the most powerful nation in the world, so no point.",
            "awry_utt": false
        }
    ],
    "fzrnaq9": [
        {
            "utt_idx": 0,
            "utt_id": "fzrnaq9",
            "speaker": "fox-mcleod",
            "text": "You seem to misunderstand the goal and history of affirmative action. That's okay. Most people do. \n\nThe goal is not to create a level playing field. The goal is not to 're-correct' for prejudice. The goal is not even to benefit the \"recipients\" of affirmative action. \n\n**The goal of affirmative action is desegregation**\n\nBrown Vs. Board of Ed. found that separate but equal never was equal. If that's true, what do we do about defacto separation due to segregation? We need to have future generations of CEOs, judges and teachers who represent 'underrepresented' minorities. \n\nWhat we ended up having to do was bussing, and AA. \nBussing is moving minorities from segregated neighborhoods into white schools. The idea is for white people to see black faces and the diversity that similar appearance can hide. Seeing that some blacks are Americans and some are Africans would be an important part of desegregation. \n\n**Affirmative action isn't charity to those involved and it isn't supposed to be**\n\nA sober look at the effect of bussing on the kids who were sent to schools with a class that hated them asked that it wasn't a charity. It wasn't even fair to them. We're did it because the country was suffering from the evil of racism and exposure is the only way to heal it. \n\nhttp://www.npr.org/sections/ed/2016/10/06/496411024/why-busing-didnt-end-school-segregation\n\nAffirmative action in schools is similar. Evidence shows that students who are pulled into colleges in which they are underrepresented puts them off balance and often has bad outcomes for those individuals. The beneficiary is society as a whole. AA isn't charity for the underprivileged. Pell grants do that. AA is desegregation.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "fzxj3mx",
            "speaker": "yeoxnuuq",
            "text": "You seem to not grasp the concept that favoring one group over another is inherently racist regardless of the justification.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "fzxypt8",
            "speaker": "fox-mcleod",
            "text": "I mean... that’s just wrong. You’re confusing discrimination and racism.",
            "awry_utt": false
        }
    ],
    "g1mg7a4": [
        {
            "utt_idx": 0,
            "utt_id": "g1mg7a4",
            "speaker": "fuzzymonkey5432",
            "text": "The most distressing thing I find is that you think all those things, (pleasureful \"Happy things\") will bring you happiness. You want to watch Youtube for 70 years? You think that will make you happy? I pull one all-day binge and I feel more depressed than a squished pop can. And then again, what is the purpose of life. Pleasure??? Expedience??? I tell you sincerely these things will give you no good. Pursuit of happiness is a lie, a facade. You can never reach happiness. It has been tried in every nation for thousands of years, among every race and every class and every generation, but it will never come to you. Happiness can only come as a byproduct of long years of hurt and sorrow. Purposefully inflict suffering and discomfort on yourself in the good of others, that will make you happy. \n\n&amp;#x200B;\n\nMy advice, Read Voltaire, Candide or optimism. Ya boi spends his entire life trying to find happiness in every country (even makes it to eldorado) and ultimately concludes the best way to be happy is to be content with what you have and work your garden.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "g1miidv",
            "speaker": "0xCuber",
            "text": "Very poor reasoning and misrepresentation of me.\nI completely disagree.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "g1mk41r",
            "speaker": "fuzzymonkey5432",
            "text": "Ok, I apologize, I was merely working with what you had given me. So let me ask you a question then: Do you run from work because of the constrictions in our society and you don't want to fit into the world's box? Or is it that you do not want to make any sort of sacrifice and think happiness can come from taking and never giving. One question, Please answer, I await your response.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "g1mn6rs",
            "speaker": "0xCuber",
            "text": "I don't want to work because I simply don't need the extra money.\nI am happy with what I have and working 8h a day for money that I have no use for seems idiotic to me.\n\nNever giving? No. But I can give friends, my partner or anyone who wants my help back. I am willing to help if someone asks me. \n\nI don't need a job for this.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "g1mpl95",
            "speaker": "fuzzymonkey5432",
            "text": "So you are willing to give to friends, family, partner, or anyone you love. correct? Well what about a friend of a friend? or a cousin of your cousin? How far does the web of people you love go before you are unwilling to help them? And why should you only help you close ones? Surely giving to the world (and forget money this is not the focus here) would warrant them giving something to you back. Kind of like in \"Its a wonderful Life\" where the guy sacrifices his whole life and his end result is he is happy and the whole town loves him. Personally I just love everyone, the whole world, period, So I feel no regret giving to all of them.",
            "awry_utt": false
        }
    ],
    "g2zzr9m": [
        {
            "utt_idx": 0,
            "utt_id": "g2zzr9m",
            "speaker": "zeroicey",
            "text": "Strange because I'm pretty sure Dylan Roof was bought a Burger King after he committed MASS MURDER. \n\n\nPolice brutatlity doesn't happen because people don't have compassion for criminals. Police brutality happens becauss the police are literally an organisation based on catching slaves and they continue thier racist legacy all around the world because we live in a racist society that allows police to have unchecked power. \n\nWhen America sees black people as HUMAN (fuck compassion) then perhaps policd brutality will ease up.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "g301svu",
            "speaker": "Ntghgthdgdcrtdtrk",
            "text": "It helps that Dylan was compliant, calm and polite.\n\nYou can whine about \"muh racism\" with no results for another 100 years if you're not willing to face the truth: the behaviors of black criminals when getting arrested is part of the reason they get killed so much.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "g309fvi",
            "speaker": "zeroicey",
            "text": "Ohhhh I get it. So if I feel like being treated like a human after I masscare a bunch of people all I need to do is be compliant calm and polite. Just wondering is that during the murdering and massacring or only after?",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "g309vla",
            "speaker": "Ntghgthdgdcrtdtrk",
            "text": "Being a drama queen won't change reality.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "g33g6iu",
            "speaker": "zeroicey",
            "text": "Omg your so right. If I just stop making a big deal about racist murdering police, they would stop being so racist and murderey.\n\nAppreciate your insight fr !!",
            "awry_utt": false
        }
    ],
    "g6ziodt": [
        {
            "utt_idx": 0,
            "utt_id": "g6ziodt",
            "speaker": "karensaccountant",
            "text": "Gender\n\n&gt;And don’t call me Cis, if you get to decide how we address you, pronouns and all, I get to decide how you address me.\n\nAs a fellow cis person, I really don't understand why you're so upset with that term. It's just a convenient way to say that someone isn't transgender, i.e. that their gender identity matches the sex they were born with. Also, you're creating a double standard here. The way you see it, trans people have the right to decide which pronouns people should use to refer to them, but under the condition that cis people should have both the right to decide which pronouns people should use to refer to them (cis people) *and* the right to prohibit other people from calling them *cisgender*. Sure, both are ultimately connected to how you address someone, but you're still giving cis people greater rights.\n\n&gt;People who are trans are trans, people who are not trans don’t need a label equal to identify them as not trans. They are just not trans, the default alignment.\n\nAre you also annoyed by the term *heterosexual*, since that's the \"standard\" and \"normal\" sexual orientation, which, therefore, also shouldn't need a label? How about *able-bodied*? Is that also a bad expression, since people who are not disabled are \"normal\" and don't need a label?\n\n&gt;Stop giving things in the norm names and labels as if to say “the choice is your trans or cis it matters not” when it does.\n\nThat's not why *cisgender* exists and I think you know that. Literally no one is claiming that you can choose whether you're cis or trans, so the term is not a representation of such a belief.\n\n&gt;MOST people are what you call “Cis” what I call normal. And if calling it normal offends trans people, that’s fine.\n\nYou can drop the \"if\" from that second sentence. You know very well that if you call cis people *normal*, that means that trans people are *abnormal*, and that specific term is a term with strong negative connotations that offends people. I've never heard *abnormal* being used as a neutral or positive term when describing someone. Also, like I've implied earlier, why use that term only when talking about gender? Most people are heterosexual. Are non-heterosexuals *abnormal*? Most people are also not disabled. Are disabled people *abnormal*? Also, you can't preach about mutual respect and then imply it's perfectly fine to insult trans people by calling them *abnormal*. And also also, once again, you're trying to establish a double standard: it's fine when you use a negative term to describe trans people, but you have every right to be annoyed when they use *cisgender* to describe you, although that is a term that is not negative in any way.\n\n&gt;Stop defining the norm as equal to the anomaly.\n\nAre you sure *cisgender* does that? It's simply a descriptive term, not a term that states any sort of value judgment.\n\n&gt;Nothing I just said is phobic of anything, if you think it is that’s very much a you problem.\n\nYes, what you've said is transphobic and you're aware of that, which is why you've preemptively tried to label it as not transphobic. If you believe it's just fine to describe a trans person with negative or insulting terms, while you wouldn't dream of describing a cis person the same way, that's transphobic, since it implies that trans people deserve to be treated more poorly or with less respect than cis people just because they're trans. And if you feel offended that I've called one of your ideas transphobic, that's very much a you-problem.\n\n&gt;It’s not a Cis-gendered heteronormative world view, it’s the common view of man.\n\nIt's common because most people are cisgender and heterosexuals. That doesn't mean we shouldn't label it or that it's perfect or that we shouldn't question it or introduce new elements into it or that it is universally embraced or that there are no alternative viewpoints. Also, calling it \"the common view of man\" almost makes it sound like those who don't share it are somehow not a part of human race.\n\n&gt;trying to change the way everyone else sees the world to make space for you is really entitled\n\nOh, you want to talk about entitlement? Isn't it, generally speaking, cishet people, rather than LGBT people, who feel entitled to describe their sexuality and relationships as superior? Aren't cishet people those who have jailed, assaulted, murdered, fired, banned marriage and adoption to and created \"conversion\" programs for those who are sexually not like them due to an unjustified sense of superiority and entitlement? And somehow it's trans people who are entitled for asking to be treated with respect and understanding?",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "g6zwcvj",
            "speaker": "[deleted]",
            "text": "&gt; As a fellow cis person, I really don't understand why you're so upset with that term \n\nI don't identify as a cis person, never have.\n\n&gt;  It's just a convenient way to say that someone isn't transgender, i.e. that their gender identity matches the sex they were born with \n\nyep, man VS trans Man. this is what i use. i don't use CIS and and Trans man, i use Man and trans Man, as did the world till Cis was added on.\n\n&amp;#x200B;\n\n&gt;  The way you see it, trans people have the right to decide which pronouns people should use to refer to them, \n\nThey don't. I have sole authority over what use i words. if they want to make a request that's fine, but if they make a demand its not. and i withhold the right to refuse the request.\n\n&gt; Sure, both are ultimately connected to how you address someone, but you're still giving cis people greater rights. \n\nno, your elevating Trans to be comparable to CIS. it isn't. one is the default white bread package, one is not.\n\n&amp;#x200B;\n\n&gt; Are you also annoyed by the term *heterosexual*, since that's the \"standard\" and \"normal\" sexual orientation, which, therefore, also shouldn't need a label? \n\nI'm not a fan, but it has been used in scientific  texts since the 1800, and i do like traditions so i begrudgingly accept it. \n\n&gt; How about *able-bodied*? Is that also a bad expression, since people who are not disabled are \"normal\" and don't need a label? \n\nyup exactly. their are disabled/handicapped people who need assistance and then those that do not. average people.\n\n&amp;#x200B;\n\n&gt; That's not why *cisgender* exists and I think you know that. \n\nyes i am being a bit hyperbolic to inflate a point I am trying to make.\n\n&amp;#x200B;\n\n&gt; You know very well that if you call cis people *normal*, that means that trans people are *abnormal*, and that specific term is a term with strong negative connotations that offends people. \n\nsorry but i continue not to care. Trans people are a fraction of the population the amount I see society bending over to accommodate these entitled people baffles me, your degree of offence does not matter to me.\n\n&amp;#x200B;\n\n&gt;  I've never heard *abnormal* being used as a neutral or positive term when describing someone. Also, like I've implied earlier, why use that term only when talking about gender? Most people are heterosexual. Are non-heterosexuals *abnormal*? \n\nits used in science all the time. a result you do not expect is abnormal, that's all it means. i don't advocate it only with gender, its just the clearest example of the problem. Straight and Gay has no issue as it arose though common conversation. CIS is a constructed academic term, i don't support constructed academic terms being used in common conversation. its the same problem atheist had with christens over the word \"Theory\" and what it means. in common talk its one in academic its another.\n\n&amp;#x200B;\n\n&gt;  Also, you can't preach about mutual respect and then imply it's perfectly fine to insult trans people by calling them *abnormal*. \n\nif you think \"abnormal\" is an insult then its no wonder we don't get along, your gage for offence is to sensitive for me to even talk with you.\n\n&amp;#x200B;\n\n&gt; you're trying to establish a double standard: it's fine when you use a negative term to describe trans people, but you have every right to be annoyed when they use *cisgender* to describe you, although that is a term that is not negative in any way. \n\nyes i used your logic against you. It's insane that trans people demand to be called by the pronouns of their choice and assign a label to every one who isn't them with out their consent or input. do I care if people call me CIS? do i get offended? No. it just bugs me. so why do u care if i call you something your not? you don't mind doing it to me.\n\n&gt; Yes, what you've said is transphobic and you're aware of that, which is why you've preemptively tried to label it as not transphobic. \n\ni stand by this to my dying breath. if you took what i said, or said above as a dislike, hatred, or devaluation of trans-people. thats becuase you read it in their. the worst i said was a cold disinterest, and a desire to be left alone by the whole thing. You see opposition in neutrality.\n\n&amp;#x200B;\n\n&gt;  If you believe it's just fine to describe a trans person with negative or insulting terms, while you wouldn't dream of describing a cis person the same way, that's transphobic, since it implies that trans people deserve to be treated more poorly or with less respect than cis people just because they're trans \n\nif you thing \"abnormal\" is negative and insulting i cant help you. its a descriptor of something that was unexpected. it carries no positive or negative beyond you you prescribe it.\n\n&amp;#x200B;\n\n&gt; And if you feel offended that I've called one of your ideas transphobic, that's very much a you-problem. \n\nIDGAF what you think honestly. you seem rather closeminded and sure of your self.\n\n&gt; Also, calling it \"the common view of man\" almost makes it sound like those who don't share it are somehow not a part of human race. \n\nno, this is jsut yoru read on it. Mankind has been used to ineitfy the speices for ages. if you see \"the common view of man\" and feel excluded by the statmet, i would ask your self why you feel you are so alien to the majority of your species this stament ameks you feel exlcuded.\n\n&amp;#x200B;\n\n&gt; Isn't it, generally speaking, cishet people, rather than LGBT people, who feel entitled to describe their sexuality and relationships as superior? \n\nsuperior? no. intended? yea. the biological purpose of the species? yes. I've never met any one who thinks cis-hetro sexuality is superior, outside of religious zealots. they might say standard, or default, but neither of those are synonymous with superior.\n\n&amp;#x200B;\n\n&gt; aren't cishet people those who have jailed, assaulted, murdered, fired, banned marriage and adoption to and created \"conversion\" programs for those who are sexually not like them due to an unjustified sense of superiority and entitlement?  \n\nso if you are going do divide the population between \"cishet\" and LGBT I'm laughing you out of this conversation. you can not attribute to a group the actions of the entire population. i call the LGBT movement entitled because the movement, the institutions , systems and organizations that comprise it make the most egregious demands.\n\n&amp;#x200B;\n\nasking to call some one by a pronoun they did not select is not your right. to make taht demand of some one is the most entitled request any rights group has ever made, you are asking to determine the speech i use. regardless of your reasoning this request is egregious and you dont even understand why.\n\n&amp;#x200B;\n\nyou address nothing i said save the comments on gender. i don't think you want to change my view i think you want to defend yours.",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "g72zrki",
            "speaker": "begonetoxicpeople",
            "text": "\\&gt; And I withhold the right \\[to refuse to respect someones pronouns\\]\n\nOkay then. Ill use my right to only ever call you 'Cis'. You cant make demands of me, after all.",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "g735ad0",
            "speaker": "[deleted]",
            "text": "&gt; Okay then. Ill use my right to only ever call you 'Cis'. You cant make demands of me, after all. \n\nthis i am ok with, and i will call you as i see fit.\n\n&amp;#x200B;\n\nI'm really happy we agreed on this",
            "awry_utt": true
        }
    ],
    "g8616uq": [
        {
            "utt_idx": 0,
            "utt_id": "g8616uq",
            "speaker": "reddragon276789",
            "text": "Free speech is free speech, whether you agree with it or not.\n\nIt’s the 1st amendment.\n\nWhat you’re saying is very dangerous and a slippery slope.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "g8634kz",
            "speaker": "witheredwolves",
            "text": "Discrimination is not free speech. Saying \"kill all jews\" is not free speech. If you were black, or queer, or any minority, you would understand. But youre not.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "g8654bg",
            "speaker": "HerodotusStark",
            "text": "It is free speech. The Supreme Court has repeatedly upheld that nearly any speech, with the exception of speech causing imminent lawless action, is legal in America. It should stay that way.",
            "awry_utt": false
        }
    ],
    "g9iq2a3": [
        {
            "utt_idx": 0,
            "utt_id": "g9iq2a3",
            "speaker": "Cunninghams_right",
            "text": "Musk tweeted a trolling reply to someone. that's it. that's all there is to it. wasting any more brainpower on it is moronic.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "g9k4oe7",
            "speaker": "MicaCap",
            "text": "He wasn't trolling. He actually believes that because it benefits his business. Let's at least waste enough brainpower to acknowledge he has this pov because he's a capitalist imperialist.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "g9k8e5a",
            "speaker": "distantcodersroomate",
            "text": "Do you mind substanciating your claims?",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "g9k92ce",
            "speaker": "MicaCap",
            "text": "If Elon is not an imperialist capitalist what is he? Dude literally wants to start his own civilization on another planet",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "g9kbbi3",
            "speaker": "distantcodersroomate",
            "text": "Who doesn't want to start a civilization on another planet? Are we all imperialist capitalists?",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "g9keffx",
            "speaker": "MicaCap",
            "text": "I don't want that. But wanting that doesn't internetly make you capitalist. Doing it as a private enterprise does.\n\nMusk is an imperialist capitalist because he supports interventionist policies that favor big business (see the tweet in question) and because he's personally a mega billionaire business magnate (I.e. capitalist). Don't be dense.\n\nYou and people like you are imperialist capitalist APOLOGISTS. Totally different.",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "g9kfhcx",
            "speaker": "distantcodersroomate",
            "text": "You're against colonizing Mars? Why?",
            "awry_utt": false
        },
        {
            "utt_idx": 7,
            "utt_id": "g9kk7x2",
            "speaker": "MicaCap",
            "text": "In a word, because there is nothing on Mars for us. It is an incredible waste of resources and human effort to try to establish a colony on a dead world just because we MAY be able to.\n\nLiterally everything on the colony will come from Earth, which means massive amounts of resource extraction are necessary. We're already destroying life on Earth extracting incredible quantities of resources for computers, cell phones, cars, batteries, etc. All the materials used for consumer goods will become even more expensive and progressively more difficult to extract. We can see this is already the case with fossil fuels. Soon enough coltan, lithium, copper, and the literally hundreds of other nonrenewable substances that go into modern tech will be just as difficult to source. Eventually under our current governing philosophy they will effectively run out or be prohibitively expensive to extract. So we should focus on moving away from these entirely, or recycling what we have, rather then plotting a course for the future which assumes massive expansion of extraction until the resources are exhausted.\n\nThe human cost of extracting these resources for trivial uses is already unconscionabe. Doubly so to put a few people on another planet. Considering the terrible suffering and waste involved in acquiring, refining, and manufacturing with them, these resources shouldn't be used the way they are currently (planned obsolescence in everything, yearly upgrades, rich people's toy electric cars) much less in an even more aggressive way which indefinitely removes them from the planet.\n\nYou're for destroying and abandoning Earth? Why?",
            "awry_utt": false
        }
    ],
    "gbgevq3": [
        {
            "utt_idx": 0,
            "utt_id": "gbgevq3",
            "speaker": "SexyElf77",
            "text": "Let me first tell you that, as a black person, roughly 50%-60% of black people still disapprove of the n-word for the same reason you do. But I think it just boils down to ***why it’s so hard for you just to not say it?*** It’s in the past. Practice what you preach. Because I can tell by your tone that the only reason you give a shit is because you want to say it, and not even with a looser A.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "gbgfc2a",
            "speaker": "1_minute_to_midnight",
            "text": "You can't just make assumptions about a person like that. You are just being hostile. If you look at my other comments you'll come to realize that I don't want to say it and I sincerely believe if I do, it can cause pain in people. See Matt Dillahunty's video: Foolish Assumptions.\n\n&amp;#x200B;\n\nEdit: Also I've changed my view long before you commented. Also I'm also dark-skinned.....and I'm indian and have never interacted with an african before.",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "gbggezx",
            "speaker": "SexyElf77",
            "text": "“Evidence”\n\n“I’m not racist, but...”\n\n“I’m actually not white, I’m (Name of ethnic group in which said group never refers to themselves by)”\n\nYup. Definitely not “Indian”, definitely racist.",
            "awry_utt": true
        }
    ],
    "gfu9it0": [
        {
            "utt_idx": 0,
            "utt_id": "gfu9it0",
            "speaker": "solarity52",
            "text": "*Conspiracy without proof has become unsupported reality,*\n\nYou mean like that whole \"Trump conspired with Russia to defeat Hillary\" thing?  I assume you got pretty worked up about that 3 year bit of \"fascism\" as well.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "gfv5os1",
            "speaker": "Bo_obz",
            "text": "Exactly. How soon they forget. \n\nThe left are such collasal hypocrites. \n\nThey screamed and cried foul every day since he was elected then the second it looks like a democrat will win, they completely changed their tune saying this was the most secure election ever. Lol. They think we're so stupid.\n\nAnd no, they didn't find anything with the Mueller report. 30k in Facebook ads that were pro left and pro right propaganda didn't mean shit. The msm just needed to cover for their team for not losing so they needed a boogie man (russia!). And mostly just a whole lot of projection as it was really Hillary trying to get dirt from the Russians about Trump (same deal with Ukraine gate where it actually was Joe Biden doing the quid pro quo on fucking camera). But of course that's not reported by the left wing MSM so people just believe whatever garbage propaganda they ascribe to. Good little sheep.",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "gfv8rs6",
            "speaker": "PsychedelicArmadillo",
            "text": "Oh you mean the Mueller report that lead to 37 indictments and 7 guilty pleas/convictions in the Trump campaign?\n\nThe one where it lists how multiple Trump associates and Trump himself repeatedly lied or refused to answer questions about their Russian contacts?\n\nThe one that found Russian interference in the election was sweeping and systemic?\n\nThat same one that found that Trump's campaign and the Russian government had numerous links?\n\nhttps://www.acslaw.org/projects/the-presidential-investigation-education-project/other-resources/key-findings-of-the-mueller-report/",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "gfv9vaf",
            "speaker": "Bo_obz",
            "text": "All means nothing. And if any of this was actually true or mattered, has Russia benefited from Trump the last 4 years? Absolutely not. \n\nAlso, why didn't Russia hack this election too? Lol what a joke. \n\nGet ready for the US of China under Joe. You useful idiots will (hopefully) get it one day but it'll be too late...try to wake up sooner!",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "gfvazid",
            "speaker": "PsychedelicArmadillo",
            "text": "How does it all mean nothing? You fucking trump supporters are so dumb. “The Mueller report didn’t find anything” I then present you with evidence of the Mueller report (and the fact that Trump was impeached) and you go ahead and move the goalposts.",
            "awry_utt": true
        },
        {
            "utt_idx": 5,
            "utt_id": "gfvft61",
            "speaker": "Bo_obz",
            "text": "It was political theater. Anyone with two brain cells to rub together realized it.\n\nAnd Trump got impeached for trying to look into China Joe's corrupt crack head prostitute loving son who was off in China, Ukraine and Russia making tons of dirty money using his daddies name, which hunter admitted to on his 60 minute interview.",
            "awry_utt": false
        }
    ],
    "gipvrot": [
        {
            "utt_idx": 0,
            "utt_id": "gipvrot",
            "speaker": "runs_in_the_jeans",
            "text": "Can you please provide proof for each of your claims? I know most of what you’ve said here is false or a mis-representation of the president’s words, but you made the claims so you need to support those claims with proof. If you cannot do that then your claims have no merit.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "gipxb62",
            "speaker": "AdeptLowbei",
            "text": "Everything I stated is factual and there are sources for all of it. Its up to YOU to change MY mind by providing me evidence that my assertions are not accurate.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "gipz02l",
            "speaker": "runs_in_the_jeans",
            "text": "That’s not how this works. Typically people will provide sources for their claims in a CMV post. You have not done so. In order for us to be on the same page we need to have an understanding of the facts. Currently we don’t because you are refusing to provide evidence of your claims. You listed a bunch of things that may or may not be true and asserted they are fact. You cannot be taken seriously if you aren’t even willing to back up your own argument with verifiable, accurate, and non biased sources.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "gipzlvz",
            "speaker": "AdeptLowbei",
            "text": "Oh I am perfectly willing to back them up. Which one are you having problems with, and I will give you sources, which is, by the way, the opposite. Its me changing your mind.",
            "awry_utt": true
        },
        {
            "utt_idx": 4,
            "utt_id": "giq066h",
            "speaker": "runs_in_the_jeans",
            "text": "Every single point you made needs proof.",
            "awry_utt": true
        },
        {
            "utt_idx": 5,
            "utt_id": "giq090y",
            "speaker": "AdeptLowbei",
            "text": "Again, I am willing to provide proof for every single one. Which one are you contesting?",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "giq0b88",
            "speaker": "runs_in_the_jeans",
            "text": "I just told you. I’m contesting every single point.",
            "awry_utt": false
        }
    ],
    "gitmaz9": [
        {
            "utt_idx": 0,
            "utt_id": "gitmaz9",
            "speaker": "atthru97",
            "text": "Your entire argument is opinion based. You think abortion is immoral.\n\nSince it isn't you don't have much of a leg to stand on.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "giw0fe4",
            "speaker": "realgeneral_memeous",
            "text": "Yeah, don’t comment if you’re not going to look past the title",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "gixi69z",
            "speaker": "atthru97",
            "text": "Nothing in comment was wrong.\n\nYour entire stance here is based on an opinion you are thinking is fact.\n\n\nThus thrr entire house of cards falls",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "gixuyew",
            "speaker": "realgeneral_memeous",
            "text": "Yeah, that’s just kind of how arguments about moral values works",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "gixvsbm",
            "speaker": "atthru97",
            "text": "Your personal opinion of sexual morality has an audience of one.\n\nYour personal opinion is useless when it comes to the sexual of useless. You are claiming that ihass standing, but I could care less about your feelings when it comes to my sex life.\n\nMy sex life is none. Of your concern.",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "gixxe0p",
            "speaker": "realgeneral_memeous",
            "text": "To me it seems like you don’t understand a single thing about this topic\n\nIn case you hadn’t noticed, some particularly large countries are locked in a pretty heavy debate between anti and pro-choice, so your “personal opinion with an audience of one” is incredibly ignorant to say\n\nThis ain’t about feelings wise guy. News flash, I don’t care about your sex, unless, of course, it involves potentially killing a non consenting human life. That in itself requires a little debate on our morals surrounding when we can and can’t kill someone and why",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "giy1nfx",
            "speaker": "atthru97",
            "text": "How dare I have the audacity to actually disagree with you on an open forum. \n\nJust you because you think something is true, doesn't make it true. \n\nNewsflash: Your opinions on sex are meaningless when it comes to the sexual choices of another person. I don't have to run things past you for your approval. I can have sex as I wish and not care about your personal sexual morals because your morals are meaningless when applied to another person. \n\nYou think abortion is murder. So what. I don't, thus it doesn't matter. Thanks for sharing your opinion about the sex of others. Now watch as others disregard your opinion.",
            "awry_utt": false
        }
    ],
    "gpixq83": [
        {
            "utt_idx": 0,
            "utt_id": "gpixq83",
            "speaker": "jadams2345",
            "text": "I doubt you are looking for someone to actually change your mind. Your mind seems pretty set. You seem like you are here to vent as you feel you have been wronged. That said, Islam has nothing to do with anything you are saying. Yes, it can be hard to be a minority in an Islamic country, actually, it is generally hard to be a minority in any country that has a common religion or philosophy. I suggest to move elsewhere.\n\nYou probably have been abused in the name of Islam. To think that nearly 2 billion people are a cult and a growing one at that, is not reasonable.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "gpj2yr1",
            "speaker": "AUrugby",
            "text": "LOL, ya, I bet you think it’s a religion of peace too.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "gpj5kke",
            "speaker": "jadams2345",
            "text": "Any school of thought can be made violent if the people are. There are violent Buddhists, violent Christians and violent Muslims. The fact is, if ALL Muslims were violent, or just predominantly so, that's nearly 2 billions violent individuals we are talking about here, the Earth would have been free of humans long time ago.\n\nAnyway, it's already hard to have discussions in the internet, a lot more on subjects like this where there is stigma. So I'll stop here. Feel free to believe what you want :)",
            "awry_utt": false
        }
    ],
    "gwj9nvs": [
        {
            "utt_idx": 0,
            "utt_id": "gwj9nvs",
            "speaker": "ArielTheKidd",
            "text": "I’ll go ahead and betray us all but it IS all men. \nIf you’re a woman, why leave one man who harassers you when the next one is likely to do so too?\nIt’s like every other woman that gets significantly harassed by men at some point, like imagine if someone grabbed your ass or felt you up uninvited. Saying “not all men” is a giveaway that you think this isn’t and shouldn’t be your problem which is unhelpful and kinda lets violence against women continue on.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "gwjbvac",
            "speaker": "fox-mcleod",
            "text": "This doesn’t... make any sense. \n\nAll men? Gay men are harassing women? Asexual men are harassing women? Trans men are harassing women?\n\nI don’t even understand what you’re achieving by claiming it’s all men. If it’s all men, then there’s no hope of change and no reason to expect it. It’s not all men. Its not normal or acceptable. Is just assholes.",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "gwjcnar",
            "speaker": "ArielTheKidd",
            "text": "Yep, and admitting we have a problem is the first step to solving it. Idk about gay or trans men but obviously you aren’t any of that so don’t go throwing them under the bus for your argument.",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "gwjinsd",
            "speaker": "fox-mcleod",
            "text": "Wait what?\n\n&gt; Yep, \n\nOkay so you *are* including gay men. \n\n&gt; Idk about gay or trans men \n\nOkay so you aren’t including gay men and it’s *not* all men. \n\n&gt; but obviously you aren’t any of that \n\nWhat now?\n\n&gt; so don’t go throwing them under the bus for your argument.\n\nWhat bus did I throw them under? The “not harassing women” bus?\n\nAnd what do you think my argument is? How would whether I’m gay affect an argument about men generally?",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "gwjpfr7",
            "speaker": "ArielTheKidd",
            "text": "You're using gay and trans people in your argument when you aren't either of those and the harm against women stems mostly from cis straight men, but hell I'd argue that even gay men perpetrate some of the sexism.\n\nI know you aren't gay or trans because they aren't the ones shaking in their boots when \"not all men\" gets challenged.",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "gwjuyki",
            "speaker": "fox-mcleod",
            "text": "Dude. One look at your post history and I’m fully confident in your personal stake in this argument.",
            "awry_utt": true
        },
        {
            "utt_idx": 6,
            "utt_id": "gwjz41x",
            "speaker": "ArielTheKidd",
            "text": "Neat, ad hom, so what would you say is my stake in this argument then?  \nTake a long good look at my history and tell me if you think I'm trying to put women down.  \n\n\nSpoilers: as a group, I'm most against cracker-ass cracker men :D  \nReverse racism + reverse sexism against those who do maintain the systemic issue.",
            "awry_utt": false
        },
        {
            "utt_idx": 7,
            "utt_id": "gwkamww",
            "speaker": "fox-mcleod",
            "text": "&gt; Neat, ad hom\n\n\nOh are we *not* doing that? Then what does my personal sexual orientation have to do with my argument?",
            "awry_utt": true
        },
        {
            "utt_idx": 8,
            "utt_id": "gwkfels",
            "speaker": "ArielTheKidd",
            "text": "Yeah, I’m not the one digging through your profile like it has anything to do with THIS conversation so no I didn’t think we were doing that. \n\nYour personal orientation has nothing to do with it, so why did you ever bring up gays and trans in the first place? Just to justify saying “not all men”? Your opinion is useless in addressing male violence and only serves as a haven for violent men.\n\nThis hill you’re defending is so crap that even the OP got his post removed for it being the obvious devil’s advocate position that it is.",
            "awry_utt": false
        },
        {
            "utt_idx": 9,
            "utt_id": "gwkflqj",
            "speaker": "fox-mcleod",
            "text": "&gt;Your personal orientation has nothing to do with it, so why did you ever bring up gays and trans in the first place? \n\nBecause you made a claim I can prove you don’t believe. And honestly, I just think you forgot about gay men. \n\n&gt; Just to justify saying “not all men”? \n\nCorrect. It’s not *all men* is it?",
            "awry_utt": false
        },
        {
            "utt_idx": 10,
            "utt_id": "gwkg82k",
            "speaker": "ArielTheKidd",
            "text": "In your case, it’s ALLLLL the men in the world 🤷‍♀️",
            "awry_utt": true
        },
        {
            "utt_idx": 11,
            "utt_id": "gwkguie",
            "speaker": "fox-mcleod",
            "text": "Lol, so it’s *not* all is not what you’re saying. \n\nDude, your opening point was:\n\n&gt; why leave one man who harassers you when the next one is likely to do so too?\n\nWhich *kind of* suggests that we do nothing to change because it’s *all men*. The good news is, it’s not. So that woman *should* leave a harasser — right?",
            "awry_utt": false
        }
    ],
    "gzw8tlk": [
        {
            "utt_idx": 0,
            "utt_id": "gzw8tlk",
            "speaker": "Head_Original5469",
            "text": "You are literally basing your entire moral position that you are morally superior to conservatives and that your evil opponent needs to be destroyed. In writing this post you are proving that you, in and of your self, and your support of progressive policies comes out of the idea that you are superior to others\n\n&gt; For examples, many welfare recipients are rural Americans, the bastion of conservativism, yet they vote for a party which desires to weaken the welfare system or outright eliminate it. \n\nPeople want jobs in their communities, welfare makes the nation poorer as a whole. That isnt selfish, the people there have seen how it has negatively affected their communities causing meth problems and child abuse\n\n&gt; For instance, supply side economics (which states the government should have as little involvement in the economy as possible) is illogical because we have witnessed how government intervention brought us out of a depression and a recession,\n\nYes, we got out of stagflation by Reaganomics, we got out of that absurdly bad recession in March 2020 by calming down and not overreacting (we have 80-90% recovered since then), while the Great Depression and 2008 were so mismanaged that it took 16 years and 8 years to recover. That is just proof of how supply side economics works\n\n&gt; not to mention how government provides a safety net for vulnerable citizens (i.e. food stamps, FDIC insurance, unemployment) \n\nGet rid of a safety net and replace it with spikes sticking up and you encourage people to not fall - to not do stupid stuff that causes failure. Ever see how Chinese people save money? They save every single last penny that they do not need to spend. We need to encourage that in our society, and they did that by having people starve to death if they were not wise with money in the great leap forward, then passing that on to their children. \n\nDont blow your rent on sneakers, beer, and that mustang you got on an 84 month loan at 21%\n\n&gt; Other illogical conservative policies include championing the welfare of a clump of cells in the womb, but not the baby once it is born\n\nAdoption has a 7 year wait list, to say that they dont care after it is born is absurd. \n\n&gt;  advocating for the rights of people to own guns who have a history of violence or mental illness and thus are threats to society\n\nNope, having a history of violence has disqualified you from owning guns since 1938, and being involuntarily committed since 1968. We are advocating the right to not issue warrants to shoot the wives and children of gun owners on sight because of manufactured evidence (Ruby Ridge)\n\n&gt; supporting corporate welfare over the welfare of American citizens. \n\n\"corporate welfare\" virtually always just means low interest loans. It makes the United States money. \n\nWelfare to US citizens is checks being written out. \n\n1200 dollars given to every taxpayer in the US costs 290 billion, and we got nothing back from it. The 2008 bailout had $426.4 billion invested and $441.7 billion returned.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "gzwxvhq",
            "speaker": "Applicability",
            "text": "&gt; 1200 dollars given to every taxpayer in the US costs 290 billion, and we got nothing back from it. The 2008 bailout had $426.4 billion invested and $441.7 billion returned.\n\nYeah, the people who got those checks just set them on fire. They didn't go and spend them which resulted in taxes coming back to the government and revenue for businesses. Silly liberals, just not getting the perfectly logical statements.",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "gzwy22q",
            "speaker": "Head_Original5469",
            "text": "They funded BLM riots. They didnt set the checks on fire, they set their cities on fire with them",
            "awry_utt": true
        }
    ],
    "h2mxj2m": [
        {
            "utt_idx": 0,
            "utt_id": "h2mxj2m",
            "speaker": "YourViewisBadFaith",
            "text": "It’s more risky for you to contract the illness than get the vaccine. Full stop. You’re afraid of needles? Try looking away or, I don’t know, taking a shot or something beforehand.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "h2mxsu3",
            "speaker": "damorocks1",
            "text": "Yeah so have a go at me and then tell someone to take a shot before having the vaccine… great advice Einstein",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "h2mz9t9",
            "speaker": "TooStonedForAName",
            "text": "What do you think a shot is?",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "h2mzcbs",
            "speaker": "damorocks1",
            "text": "A gunshot",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "h2mzqxc",
            "speaker": "UnderwritingRules",
            "text": "It's a shot of alcohol.  Wow\n\nhttps://en.m.wikipedia.org/wiki/Shot_glass",
            "awry_utt": false
        }
    ],
    "h4g9oci": [
        {
            "utt_idx": 0,
            "utt_id": "h4g9oci",
            "speaker": "Yharnam_Queen",
            "text": "You're a man. \n\nYou have no idea what does it mean to be a woman, so it's obvious you'd never understand the oppression.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "h4gsb9a",
            "speaker": "ElysiX",
            "text": "&gt;You're a *wo*man.\n\n&gt;You have no idea what does it mean to be a *wo*man, so it's obvious you'd never understand the oppression.\n\nSee how that goes both ways?",
            "awry_utt": true
        }
    ],
    "h8mfqow": [
        {
            "utt_idx": 0,
            "utt_id": "h8mfqow",
            "speaker": "o2cmefly",
            "text": "Climate change isn’t an ‘existential threat’, nor is it a ‘crisis’ of any kind. The IPCC is full of shit, and always has been. How do I know? Simple. If they’d prove there was no warming or ‘change’, they’d have been defunded 30 years ago. The grants that fund them were given to those pursuing avenues of study that would further their agenda. Avenues that would prove them wrong were not given grant funding. \n\nHave kids. Live your life. Stop listening to the government and media. Climate change is nothing more than a wealth redistribution scam. If you think I’m wrong, answer me this: If CO2 is so harmful, why do plants breathe it in? Also, how can CO2, which comprises only 0.04% (400ppm) of our atmosphere cause so much harm? It can’t.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "h8mtmqi",
            "speaker": "hidden-shadow",
            "text": "&gt; If you think I’m wrong, answer me this: If CO2 is so harmful, why do plants breathe it in?\n\nI'd suggest that maybe you didn't pay close enough attention in school. CO2 is harmful to humans... because we aren't plants! We have evolved entirely different biological processes, why would you make the thousand logical leaps to get to such a statement?",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "h8oa0vv",
            "speaker": "o2cmefly",
            "text": "I don’t have to make “logical leaps” for a gas present in such a minuscule quantity. Maybe you can explain how a gas that’s only 0.04% (400ppm) of the air we breathe is harmful to us, and wreaks all this catastrophic ‘climate change’.",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "h8qfpz8",
            "speaker": "hidden-shadow",
            "text": "Changing arguments I see. Since it's been a while between now and my last tertiary course involving the subject, I would rather give you some good links in layman's terms.\n\n[https://theconversation.com/climate-explained-why-carbon-dioxide-has-such-outsized-influence-on-earths-climate-123064](https://theconversation.com/climate-explained-why-carbon-dioxide-has-such-outsized-influence-on-earths-climate-123064)\n\nslightly more out of date,\n\n[https://www.scientificamerican.com/article/if-carbon-dioxide-makes-u/](https://www.scientificamerican.com/article/if-carbon-dioxide-makes-u/)\n\nBut if that is not enough,\n\n[https://www.publish.csiro.au/ebook/chapter/CSIRO\\_CC\\_Chapter%202](https://www.publish.csiro.au/ebook/chapter/CSIRO_CC_Chapter%202)\n\nLook, I'll be honest, I struggle to explain this without getting a bit mad so bear with me (science denial has a visceral reaction). So one, we are really poorly made creatures that can't even tell that we're breathing in oxygen; instead the mechanism relies on CO2 concentration, which is what my comment on logical leaps was about (you did make them, paraphrasing - just because plants breathe CO2, it must also be okay for humans - big logical leap). Two, in response to the change in topic, it is unrelated to our breathing in of CO2 via which it affects the climate. Read those links for a short summary, but plenty of things in small quantities and concentrations are dangerous and we should be worried by the large relative change in concentration (which is what our concern is about funnily enough).\n\nCan you, in response, explain why you **do not** think such a large relative change in the concentrations of our atmosphere would not have an effect on the climate? Is it scientific illiteracy, poor education, bad teaching, ignorance or stupidity that misinforms your opinion? I would honestly like to know, I've only ever met one other person in denial about the science and they were a conspiracy theorist. It's always good to get a larger statistical pool to inform my understanding of this line of thought.\n\nNot matter your response (or non-response) I want you to understand that this is provable science, even if you do not comprehend it does not negate the truth. Have a little faith in humanity, and have a good day.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "h8r44xl",
            "speaker": "o2cmefly",
            "text": "I never said CO2 was good for us to breathe just because it’s good for plants. YOU made that assumption, and poorly, calling it a ‘logical leap’ that you assume I’d made. I didn’t. You were grabbing at straws to discredit my argument because it disagrees with yours. \n\nYour links were written by leftists who agree with your position. You presented them only due to confirmation bias. \n\nAs for the science, it’s quite simple. CO2 was found in a much larger concentration many thousands of years ago. During the Paleozoic Era, the average CO2 concentration was about 1600ppm, or 0.16%, 4 times what it is today. Yet the average annual temperature wasn’t much different than today, within 1 degree Celsius. The Earth has cycles is goes through, some of which last decades. There have been ice ages, and periods of warming, followed by ice ages again. Our orbit around the sun changes too, affecting all of this.\n\nThe climate is constantly changing, gradually. It always will. None of it is human-caused. Do we as humans have an impact? Sure, but a small one, and nothing the planet can’t shrug off. Regardless of how you feel about the science, there are a few things that are irrefutable:\n\n1- Assuming CO2 is the culprit, and reducing it would lower the Earth’s temperature, doing the math says it would take more than 30 years of ZERO global emissions to reduce the average annual temperature by 1 degree Celsius. This will never happen. Too many countries (China) will never curtail theirs. In truth the U.S. is one of the cleanest, not the dirtiest as the media would have you believe. China and India are the current worst offenders.\n\n2- It doesn’t matter whether either one of us can prove our science on this. It’s questionable for one big reason: you’d have to be a complete idiot to believe that paying more taxes, and giving the government (any government) more money to throw at the problem, will do anything to fix it. If the governments of the world (U.S. included) have proven one thing, it’s that they’re grossly inept at solving the world’s problems. \n\n3- Follow the money. See who profits from ‘climate change’. See who’s looking to get more control over segments of the economy.\n\n4- Nothing we’re currently doing has any impact at all. EV’s are a joke. Hybrids are a joke. There isn’t a single hybrid or EV that can ever recover through fuel savings, the carbon emissions expended during it’s manufacture, transportation to market, and use during it’s lifespan on the road. This is true for just the batteries ALONE, never mind any other part, or the whole car itself. Every EV uses electricity generated by fossil fuels. \n\n5- Fossil fuels are still the most cost-effective energy source in existence, and it’s not even close. It takes over 25 lbs. of lithium-ion batteries to equal the potential energy in 1 gallon of gas (which weighs only 7 pounds). EV’s are cute and novel, but still far from practical for anything more than short-range or intracity travel.",
            "awry_utt": false
        }
    ],
    "hax9stn": [
        {
            "utt_idx": 0,
            "utt_id": "hax9stn",
            "speaker": "SILENTLINK9",
            "text": "Hilarious you guys just skip over the misinformation from the Fraud Fouci and the deliberate lies he told 🤣🤣 or the world health and China ... like they are some conservatives 🤣🤣 fuckin idiots",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "haxmyg4",
            "speaker": "jizzyp69",
            "text": "Another person who just assumes anyone who speaks like an educated adult human being is an extreme liberal and kisses Fouci’s ass. I bet you’ve done nothing but read articles about how dumb the vaccine is and talk amongst your tiny group of close minded friends about it as well. \n\nThere’s misinformation everywhere, trust the data coming through, not what someone says on TV 🙄",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "haxo6a8",
            "speaker": "SILENTLINK9",
            "text": "Oh ok trust the data ... the ones the Cdc constantly has to adjust because they over report and count car crashes as Covid deaths 🤣🤣 ok got it trust the data",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "haxwa8o",
            "speaker": "ams833",
            "text": "Lol imagine thinking doctors should know everything about a disease that didn’t exist weeks before. Medical recommendations change, when there is better data and information we update recommendations. That doesn’t mean it’s misinformation. Embarrassing take",
            "awry_utt": true
        }
    ],
    "heq2t6c": [
        {
            "utt_idx": 0,
            "utt_id": "heq2t6c",
            "speaker": "[deleted]",
            "text": "&gt;what wont change my view: \"i like it\" or \"it's not about everyone else, it's about what i like\" that's just selfish.\n\nSays the guy who doesn't want it to even exist because he finds it personally annoying.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "heqq7q1",
            "speaker": "unbelizeable1",
            "text": "IMO it's rude to subject others to stuff like that, be it your clickly clacks, some game sound effects, phone call on speaker phone ,or your music. Silence your shit in public places.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "heqvm8v",
            "speaker": "[deleted]",
            "text": "&gt; in public places.\n\nThe relevant part here.   You're in public.   Part of being in public is having other people there, too.   You don't get to tell them to be silent.   \n\nGet yourself some earbuds or stay home if silence is so precious to you.",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "heqwttm",
            "speaker": "unbelizeable1",
            "text": "&gt;You don't get to tell them to be silent.\n\nNever did, you'll notice there's a whole ton of other noises that happen in public that I didn't mention. Some things are just considered to be rude behavior.\n\nIt's like a guy walking down the sidewalk swinging his arms like a windmill and you saying \"just don't stand near that guy\". While this may be true, the dude is still a dick.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "heqy5xa",
            "speaker": "[deleted]",
            "text": "&gt;Never did\n\nThis you?\n\n&gt;Silence your shit in public places.",
            "awry_utt": true
        }
    ],
    "hfjq9ku": [
        {
            "utt_idx": 0,
            "utt_id": "hfjq9ku",
            "speaker": "ThisCharmingManTX",
            "text": "\"If a company can't pay people for their time, the company doesn't deserve to survive\".... (Paraphrase)\n\nYou just put about 20% of the workforce on welfare.  You stopped about a third of all entrepreneurs from risking starting a business.  You know absolutely nothing about running a business.\n\nThe market is taking care of itself as it always does without government control.  It's an employees market right now so wages will increase.  When the full inflationary effect kicks in, job growth won't exist.\n\nThanks Dems!!",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "hfjqleh",
            "speaker": "Opr9r",
            "text": "Funny that you’re all about shouting-down socialism until it comes time to demand that people work for less than they’re worth to keep non-viable businesses solvent.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "hfjqtd6",
            "speaker": "ThisCharmingManTX",
            "text": "There wouldn't be any businesses in your world but you're programmed not to realize it.\n\nKeep blaming others all the time.  You have a future in Dem politics.",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "hfjrmd5",
            "speaker": "Opr9r",
            "text": "That argument would have been right at home in the antebellum South. “Hey man, without slaves the cotton industry wouldn’t exist.”",
            "awry_utt": false
        }
    ],
    "hjlc0mb": [
        {
            "utt_idx": 0,
            "utt_id": "hjlc0mb",
            "speaker": "AnnaE390",
            "text": "You do not know what anarchy or capitalism is.\n\nAnarchy is not the elimination of all hierarchies.  Anarchy is the elimination of artificial authorities like governments and kings.  So hierarchies that arise as a result of innate differences among human beings will still exist. Some people will still be smarter than others.  Some people will be more beautiful or persuasive.  In an anarchic society, people will use their unique qualities to their advantage, and as a result, individuals will experience different economic and social outcomes.\n\nCapitalism is a system of voluntary exchange where individuals pursue profit rather than some collective goal.  Sure, without some overarching ethical standard, people will lie, steal, and kill within a capitalist economy, but you cannot with any honesty say the risk of being murdered in a capitalist society is greater than in a collectivist society where governments decree murder of dissidents as a matter of principle.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "hjn00a1",
            "speaker": "Shimme",
            "text": "&gt; greater than in a collectivist society where governments decree murder of dissidents as a matter of principle\n\nJesse, what the fuck are you talking about?.png",
            "awry_utt": true
        }
    ],
    "hjoajny": [
        {
            "utt_idx": 0,
            "utt_id": "hjoajny",
            "speaker": "farbauti007",
            "text": "Ok, thats not smart at all.  Thats way to much information to be throwing out there in a dating situation.  And I think the only reason you posting this is because someone YOU were dating broke up with you and that was their reason.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "hjobi1w",
            "speaker": "biscuitspls",
            "text": "I’m pretty sure your reply breaks CMV rules, and my view was already changed. Don’t be rude, especially when you can see me having a civil discussion with other posters if you just read first.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "hjocn54",
            "speaker": "farbauti007",
            "text": "Wasn't being rude. Just stating my opinion with out any vulgarity or malice.  I can understand how a negative person might perceive the comment as an attack or being rude. But I can assure you, it was simply stright forward.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "hjod3hk",
            "speaker": "biscuitspls",
            "text": "Dude, give it up. My view had already been changed.",
            "awry_utt": false
        },
        {
            "utt_idx": 4,
            "utt_id": "hjodisa",
            "speaker": "farbauti007",
            "text": "That wasn't the point of my above comment.  You accused me of being rude.  I was not. Has nothing to do with the OP. How is this not clear?",
            "awry_utt": false
        },
        {
            "utt_idx": 5,
            "utt_id": "hjoe0je",
            "speaker": "biscuitspls",
            "text": "Actually, your original comment breaks rule #3, which I pointed out originally, and the accusation is rude, especially since you could have seen I was open to changing my view if you would have just read. If what you’re writing now has nothing to do with the OP, hop off of this since you’re not trying to CMV. Thanks.",
            "awry_utt": false
        },
        {
            "utt_idx": 6,
            "utt_id": "hjofjxs",
            "speaker": "farbauti007",
            "text": "Not is not, and no it doesn't,  your just waaaay to sensitive.",
            "awry_utt": false
        },
        {
            "utt_idx": 7,
            "utt_id": "hjofnoj",
            "speaker": "biscuitspls",
            "text": "Okay, thanks! Have a great day",
            "awry_utt": false
        }
    ],
    "hjotu46": [
        {
            "utt_idx": 0,
            "utt_id": "hjotu46",
            "speaker": "RealRotkohl",
            "text": "&gt;He's released countless statements saying how affected he is.\n\nSaying and actually meaning it are two separate things.\n\n&gt;For people who said he looked at people on the ground and ignored them, how is he supposed to recognize a single thing, on stage, in a crowd of a thousand people, WHILE performing?\n\nCountless videos show performers/bands managed to notice a single person falling and stopped the show to help them up. So your argument is completely invalid.\n\n&gt;On top of this, this shit is a PUNK ROCK CONCERT. Of course shit is going to get crazy. I've seen people saying \"inciting violence is a crime.\" How vanilla can you be? It's a rock show. Of course people are going to get injured, no one expected a psycho would be going around killing people.\n\nSo? That doesn't justify violence/inciting violence. Those are still crimes, regardless.\n\n\nOverall, your entire argument is shallow, and you probably barely looked into the incident.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "hjoulox",
            "speaker": "icomefromgod",
            "text": "Y'all haven't looked into the incident. There's no way he could have noticed these things in a crowd of a thousand moving bodies. Someone should have told him and shut the concert down, he is not responsible at all. He's a performer. Hyping people up is his job.",
            "awry_utt": true
        }
    ],
    "hjvt7h7": [
        {
            "utt_idx": 0,
            "utt_id": "hjvt7h7",
            "speaker": "throwaway_0x90",
            "text": "Counterpoint:\n\nYou're going to have to provide a real world example because I don't think what you're claiming here actually happens.\n\nAt the moment we have women's sports &amp; men's sports.\n\nI have a very strong suspicion where you're going with this but I'm not going to assume or accuse you of anything yet. I want you to say it with your own mouth. Where do you see this issue in society? Give a concrete example or 2.\n\n________\n\n_EDIT: I see your replies to other comments. You're really dancing around and avoiding it. [Just say it with your chest](https://www.urbandictionary.com/define.php?term=Say%20it%20with%20your%20chest). Where is the inclusion that you don't like? Not the example you gave; you already got replies to that. Give another one. You said it's forced into everything so you must have several examples._",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "hjw76li",
            "speaker": "ibapconflicted",
            "text": "i’m just waiting for him to finally crack in the comments and reveal how he doesn’t want to see POC or women or LGBT folks in any of his hobbies lol this whole post is just “i’m a bigot, validate me and argue with me”",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "hjwq8x8",
            "speaker": "Team-First",
            "text": "You assume I’m a straight white cismale. You’re incorrect",
            "awry_utt": true
        }
    ],
    "hsqnptp": [
        {
            "utt_idx": 0,
            "utt_id": "hsqnptp",
            "speaker": "zacmaster78",
            "text": "Just to clarify, because people keep replying to me misunderstanding my point. I disagree the ethics of the verdict. I have no objective legal standing to disagree with the legality of the verdict itself. It’s already been justified in court.\n\n You don’t understand why people disagree with the verdict? \nStop thinking about the “self defense” aspect of it for a second. He was a 17 year old who got his friend to buy him a rifle in a state he didn’t live in, that he then used to kill 2 people. He was too young to own or buy a gun, so he knowingly had his friend do it for him. He then brought said firearm TO a protest, of which there were already many throughout that year with reports of violence and chaos. He was let off of his charges bc of an insanely irresponsible and dumb law/legal loophole. The actual law may be on his side, and he may have even been justified in the actual case of self defense once the violence started, but all of these other factors contributed to what went down that day. Factors that were caused by him. HE went to Kenosha. HE had his friend buy him a gun. HE went to the protest WITH the gun. If you truly can’t understand that in the slightest, I just don’t know what to tell you.\n\nAnd just a little personal note: his body language and attitude in the videos I’ve seen from that day, suggest to me that he was, in some capacity, living out some vigilante action hero fantasy that, while he may not have initiated, he was surely anticipating and potentially looking for/forward to.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "hsqz3xn",
            "speaker": "PrestigeZoe",
            "text": "&gt;Stop thinking about the “self defense” aspect of it for a second. \n\nthis basically sums up those idiots arguments who think he should have been found guilty",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "hsqzac9",
            "speaker": "zacmaster78",
            "text": "and this comment basically sums up every idiot who has absolutely no problem with any of the issues I’ve listed.",
            "awry_utt": true
        }
    ],
    "huimwj5": [
        {
            "utt_idx": 0,
            "utt_id": "huimwj5",
            "speaker": "lionelporonga",
            "text": "We fought a war over this shit... they didn’t learn the first time. Gotta punch harder I guess.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "huj1ywl",
            "speaker": "MikeyTheNord",
            "text": "You fought a war against Japan because they were a threat to your economic interests. Stop glorifying US imperialism, it doesn't give you the moral high ground.",
            "awry_utt": true
        }
    ],
    "i42tjxg": [
        {
            "utt_idx": 0,
            "utt_id": "i42tjxg",
            "speaker": "Main_Mathematician77",
            "text": "I just skimmed 2 medical research blogs on this topic and I’m still in favor of my parents making that decision for me. Fuck the flap, no offense",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "i43p83z",
            "speaker": "Axunujar",
            "text": "Then you're being [ignorant](https://www.reddit.com/r/foreskin_regeneration/comments/rmu3ey/penile_fine_touch_sensitivity_diagram_cut_vs/).",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "i468hep",
            "speaker": "Main_Mathematician77",
            "text": "Nah I don’t want extra pleasure, sex is already enough of a vice",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "i46z040",
            "speaker": "Axunujar",
            "text": "What gives you the right to make that choice for others?",
            "awry_utt": false
        }
    ],
    "iipkjim": [
        {
            "utt_idx": 0,
            "utt_id": "iipkjim",
            "speaker": "lifejustice",
            "text": "There is no way for you to define what is superfluous or not when it comes to other peoples' lives.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "iipvcby",
            "speaker": "KrazyKellz-9900",
            "text": "That's a lie, a person with three 65\" TV, the newest smart phone and both the new PlayStation and Xbox have no rights to cry about being poor when they're buying a bunch of useless shit. \n\n\nBare necessities would be: Air, water, food, shelter.",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "iipwwbk",
            "speaker": "lifejustice",
            "text": "The fact that you haven't considered tampons or other feminine products in your list of needs proves my point.\n\nNo hygiene products for male or females. Clean underwear, footwear that is appropriate for the work done....\n\nYou are in no place to determine what a person \"needs\"...",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "iipzto8",
            "speaker": "KrazyKellz-9900",
            "text": "The list of 4 was the extreme bare minimum from the internet. \n\nThose items you listed would be a necessity, a $2000 phone when a $300 phone does the same isn't a necessary. A $40K car when you're making $7.50/hr isn't a logical move either.",
            "awry_utt": false
        }
    ],
    "ij84fkz": [
        {
            "utt_idx": 0,
            "utt_id": "ij84fkz",
            "speaker": "Charlie-Wilbury",
            "text": "&gt;They raise the demand and thus raise the price and lower the supply of medical treatment.\n\nCan you prove that fat people drive up prices and lower supplies? Or is that just a theory? \n\n&gt;On planes, on busses,\n\nThis is basically impossible, you know that right? A seat is a seat, and if they take up more than one they will be charged. They are for that space. Is it immoral to be tall and need more leg room?\n\n\n\n&gt;Overweight people consume an irrational share of food that might otherwise be used to feed the undernourished. \n\nUntil there is zero food waste in America this is completely irrelevant. You throw out perfectly good food. There is no shortage. The shortage in your country is caused by poverty, not obesity. \n\n&gt;When fat people die from health conditions as a result of their physical state, this often causes serious emotional distress to loved ones that simply could've been avoided\n\nIs a fat person dying somehow more painful than a skinny person?",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ij9kt6w",
            "speaker": "brianthalion",
            "text": "Why is this always the response, \"can you prove\" no we are not scientists or economists. And there will.be atricles showing both sides. The \"can you prove\" stuff.on this subreddit has to stop",
            "awry_utt": false
        },
        {
            "utt_idx": 2,
            "utt_id": "ij9l1h7",
            "speaker": "Charlie-Wilbury",
            "text": "Because you don't just get to say whatever the fuck you want and act like it's a fact. \n\n&gt;And there will.be atricles showing both sides\n\nThen find some that prove your point? Have you ever heard of the burden of proof?",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "ij9l9dg",
            "speaker": "brianthalion",
            "text": "Yes, and this is not a.court case, OP asked to have his view changed, now to prove his point correct,  so provide them with proof, that's YOUR burden.",
            "awry_utt": true
        },
        {
            "utt_idx": 4,
            "utt_id": "ij9lj9v",
            "speaker": "Charlie-Wilbury",
            "text": "You really don't understand debate at all. He made a claim, it's his responsibility to provide the evidence. It's literally the definition of the burden of proof.",
            "awry_utt": true
        },
        {
            "utt_idx": 5,
            "utt_id": "ij9lsxb",
            "speaker": "brianthalion",
            "text": "No, YOU don't. Change My View, the title of his post and every one on this sub. He wants YOU to change his VIEW. that is his view on the subject. So change it or go somewhere else. Prove his VIEW that he stated is wrong.",
            "awry_utt": true
        },
        {
            "utt_idx": 6,
            "utt_id": "ij9lxc7",
            "speaker": "Charlie-Wilbury",
            "text": "I asked him to prove his view was based in facts, he couldn't. That's what I wanted to know. I'm sorry this upset you, now leave me alone please.",
            "awry_utt": true
        },
        {
            "utt_idx": 7,
            "utt_id": "ij9mb9l",
            "speaker": "brianthalion",
            "text": "He doesn't have to. He's ASKING something of the respondents. And your only response was , prove it. He has a view, he wants it changed, YOU prove it. That's the whole point of this sub. instead we get ppl who come her with terrible what they think is gotchas and Noone ever has a chance to see the other side of their viewpoint. The prove it response has to stop.",
            "awry_utt": false
        },
        {
            "utt_idx": 8,
            "utt_id": "ij9mh9k",
            "speaker": "Charlie-Wilbury",
            "text": "&gt;The prove it response has to stop.\n\nIf you think I'm breaking the rules, report it.",
            "awry_utt": true
        }
    ],
    "ijad4nu": [
        {
            "utt_idx": 0,
            "utt_id": "ijad4nu",
            "speaker": "Avenged_goddess",
            "text": "\n&gt;Because of the right's tendency to lie about everything in bad faith\n\nYeah, we're not off to a good start when your first statement is to broadly accuse everyone who has different political views than you of being dishonest literally all the time.\n\nHow about this. Since you're so dead certain that nobody on the right is capable of engaging with you, how about you engage in good faith here, and I'll either prove you wrong or a fool.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "ijadm18",
            "speaker": "Redmugill",
            "text": "Ok then prove me wrong.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "ijadops",
            "speaker": "Avenged_goddess",
            "text": "You actually have to participate for that to happen. Did you expect me to debate some nebulous positions you aren't even defending?",
            "awry_utt": true
        },
        {
            "utt_idx": 3,
            "utt_id": "ijadwm0",
            "speaker": "Redmugill",
            "text": "I am participating, should I give you an explanation on how this subreddit works? I present the arguments in my initial paragraph, and you give a retort in an attempt to change my view.",
            "awry_utt": false
        }
    ],
    "iufnht2": [
        {
            "utt_idx": 0,
            "utt_id": "iufnht2",
            "speaker": "jt4",
            "text": "It sounds like this just Poe's Law. We don't know if you're joking or if you really believe this ___ist thing you said. And if it's not clear if it's satire or not, it's not effective satire.\n\nOf course, now, the common refrain from someone who is called out for being a dick online is to claim it's just a joke. \n\n&gt;The joke is simply \"racism and other associated forms of baseless hatred is absurd.\"\n\nThat's not the joke. The joke is \"Turkish people aren't living beings\" - which *is* absurd, and you've included quotes which help point out the absurdity, but let's not pretend the joke is some profound statement on racism and hate-filled comments online.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "iufnvw3",
            "speaker": "Crimson03Ghost",
            "text": "I was with you until you tried to tell me what the purpose of my joke was and what I find funny. You don't know that, you're assuming it, treating as fact, and you're wrong. It is *precisely* what you're claiming I'm \"pretending\" it to be.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "iufp9n2",
            "speaker": "jt4",
            "text": "I'm not telling you what you find funny. I'm telling you why the joke is supposed to be funny. Nothing about that joke can be applied more broadly to encompass all ___ism, as you claim, and I highly doubt anyone who walked away from that joke will say that is intended to be read as \"racism is absurd\".",
            "awry_utt": false
        }
    ],
    "j0dgwfe": [
        {
            "utt_idx": 0,
            "utt_id": "j0dgwfe",
            "speaker": "Sirhc978",
            "text": "&gt;Seriously, you all barely follow the rules of your own sacred texts and then give gay/trans people shit for not following them either.\n\nAbout half of the catholic churches in my area have Pride/Trans flags hanging over the front door.",
            "awry_utt": false
        },
        {
            "utt_idx": 1,
            "utt_id": "j0dh1mo",
            "speaker": "Augsustus",
            "text": "Then those churches dont know their own scripture. The bible is clearly a genocidally anti-gay, anti non-christian book and anyone who supports it is a bad person.",
            "awry_utt": true
        },
        {
            "utt_idx": 2,
            "utt_id": "j0di437",
            "speaker": "Sirhc978",
            "text": "\"You shall keep my statutes. You shall not let your cattle breed with a different kind. You shall not sow your field with two kinds of seed, nor shall you wear a garment of cloth made of two kinds of material.\" -Leviticus 19:19\n\n\"Ye shall not make any cuttings in your flesh for the dead, nor print any marks upon you: I am the LORD\"  -Leviticus 19:28\n\n&amp;#x200B;\n\nYeah Christians/Catholics are kinda notorious for picking and choosing what they follow from the Bible.",
            "awry_utt": false
        },
        {
            "utt_idx": 3,
            "utt_id": "j0dityr",
            "speaker": "Ok-Future-5257",
            "text": "The Old Testament Law of Moses was replaced with the New Testament Law of Christ.",
            "awry_utt": false
        }
    ]
}