{
    "0": "Those are not your only two options.\n\nLogical consequences are the best form of discipline and positive reinforcement. \n\nIs your spouse or boss allowed to hit you if you make a mistake?\n\nWhere's your research that spanking is ok? I provided you with a source about why it isn't.",
    "1": "1. It doesn't mean slave.\n\n2. You're already free to use it however you like, in America or in Romania. People in America, who are white, use it all the time. No one is going to jump out of the shadows and arrest you for it.\n\nYou don't, however, get to say \"Well, I decided that its *OK*, and no one else's opinion matters, I'm right\".",
    "2": "I'm also completely free not to use heroin. If it was eradicated from the face of the planet, I would no long have the choice, thus being less \"free\", but the world would undoubtedly be a better place.",
    "3": "They were before my time. So your “ok boomer” doesn’t work with me. \n\nBut thanks for clearing up that you have no idea what your talking about.",
    "4": "Welcome to democracy.  Deal with it (hopefully using your voice vs your guns)",
    "5": "No, they have not asked to be violently ripped from the only home they have ever known, deprived of their rights, shipped en masse overseas at gunpoint, with a paltry sum to entirely start over. \n\nThis is just KKK propaganda",
    "6": "But for profit companies are paying for the research to be done. Without that funding, 3/4 of that research isn't happening. Many many people at big pharma companies aren't doing it for profit either. If you asked the scientists and engineers at Lilly, GSK, Pfizer etc why they work the way they do, they will say the same thing as the people at universities.",
    "7": "You don't compare anything to what women go through... you haven't talked about what women go through at all.",
    "8": "Can you link to some of those affidavits? If there are literally hundreds it should be easy for you to find 10 or so.",
    "9": "Oh yes, I'm totally one of the select powerful few, here to argue my point with the plebs on Reddit. Are you high?",
    "10": "&gt;Attacking the opponents identity is exactly ad hominem.\n\nNo it's not. I'm not committing a fallacy if I call you a cunt, since I'm not making an argument at all. An ad hominem would be if I said you were wrong *because* you're a cunt.",
    "11": "Is this what the alt right has been reduced to? Running around debate subs trying to give racism the benefit of the doubt? This is pathetic bro, get a better hobby and stop being racist.",
    "12": "This is literally Geometry.\nSurely you don't really think this is some advance math.\nOne could have done this in 5th grade.\n\nThe estimate is certainty more accurate but a long ways off from being a remotely good model of the universe.",
    "13": "You are. If you’re ignorant of a work you have no right to critic or praise it.",
    "14": "Or you could take care of yourself and stop relying on a free healthcare system to take care of your lazy inaction to your own health.",
    "15": "Are you not attracted to trans women because of how they look, or because they’re trans? I’ve seen plenty trans girls where you really can’t tell they’re trans. If you find them unattractive, just because of the fact that they’re trans, it’s an equality thing.",
    "16": "No, a haircut is never worse than a circumcision. Your logic is so ridiculous. I mean really, a haircut is worse than a circumcision? Stop being pretentious about something that is quite clearly and objectively not harmful. \n\n",
    "17": "Could you clarify how you're trying to change my view?",
    "18": "Ok. BLM isn't your cup of tea. There are dozens of other orginizations with a similar focus and overlapping goals. Which ones have you supported with your time and money. And what where the specific forms that support took?",
    "19": "Your assertion runs contrary to events that have actually happened with respect to defensive uses.\n\nr/dgu has plenty of examples."
}